const clasMenu = [
    {
        "cid": "1",
        "cname": "电脑手机",
        "id": "23336",
        "children": [
            {
                "cid": "26",
                "cname": "电脑",
                "id": "2084039759",
                "children": [
                    {
                        "cid": "45",
                        "cname": "Windows",
                        "id": "2084039792"
                    },
                    {
                        "cid": "46",
                        "cname": "MAC",
                        "id": "2084039798"
                    },
                    {
                        "cid": "47",
                        "cname": "PC-98",
                        "id": "2084039763"
                    },
                    {
                        "cid": "48",
                        "cname": "FM TOWNS",
                        "id": "2084039765"
                    },
                    {
                        "cid": "49",
                        "cname": "X68000",
                        "id": "2084039773"
                    },
                    {
                        "cid": "50",
                        "cname": "MSX",
                        "id": "2084039771"
                    },
                    {
                        "cid": "51",
                        "cname": "其他",
                        "id": "2084039776"
                    }
                ]
            },
            {
                "cid": "27",
                "cname": "平板电脑",
                "id": "2084292086",
                "children": [
                    {
                        "cid": "263",
                        "cname": "苹果",
                        "id": "2084257082"
                    },
                    {
                        "cid": "264",
                        "cname": "Android的",
                        "id": "2084292087"
                    },
                    {
                        "cid": "265",
                        "cname": "Windows",
                        "id": "2084239342"
                    },
                    {
                        "cid": "266",
                        "cname": "电子图书阅读器",
                        "id": "2084288672"
                    }
                ]
            },
            {
                "cid": "28",
                "cname": "手机",
                "id": "2084005067",
                "children": [
                    {
                        "cid": "1878",
                        "cname": "NTT DoCoMo公司",
                        "id": "2084008397"
                    },
                    {
                        "cid": "1879",
                        "cname": "AU",
                        "id": "2084008398"
                    },
                    {
                        "cid": "1880",
                        "cname": "软银",
                        "id": "2084008399"
                    },
                    {
                        "cid": "1881",
                        "cname": "Y手机",
                        "id": "2084235873"
                    },
                    {
                        "cid": "1882",
                        "cname": "WILLCOM",
                        "id": "2084221688"
                    },
                    {
                        "cid": "1883",
                        "cname": "对于海外手机",
                        "id": "2084239153"
                    },
                    {
                        "cid": "1884",
                        "cname": "移动装置",
                        "id": "2084298965"
                    }
                ]
            },
            {
                "cid": "29",
                "cname": "电子图书阅读器",
                "id": "2084288672",
                "children": []
            },
            {
                "cid": "30",
                "cname": "数码相机",
                "id": "2084261633",
                "children": [
                    {
                        "cid": "1644",
                        "cname": "数码单反相机",
                        "id": "2084261634"
                    },
                    {
                        "cid": "1645",
                        "cname": "反光镜可换镜头",
                        "id": "2084305443"
                    },
                    {
                        "cid": "1646",
                        "cname": "紧凑型数码相机",
                        "id": "2084261642"
                    },
                    {
                        "cid": "1647",
                        "cname": "摄像机用",
                        "id": "2084261659"
                    },
                    {
                        "cid": "1648",
                        "cname": "个人电脑连接配件",
                        "id": "2084261658"
                    },
                    {
                        "cid": "1649",
                        "cname": "说明书",
                        "id": "2084052265"
                    },
                    {
                        "cid": "1650",
                        "cname": "目录",
                        "id": "2084313032"
                    },
                    {
                        "cid": "1651",
                        "cname": "读卡器",
                        "id": "2084042337"
                    },
                    {
                        "cid": "1652",
                        "cname": "记忆卡",
                        "id": "2084039469"
                    },
                    {
                        "cid": "1653",
                        "cname": "数字照片框架",
                        "id": "2084231456"
                    }
                ]
            },
            {
                "cid": "31",
                "cname": "外部设备",
                "id": "2084039561",
                "children": [
                    {
                        "cid": "280",
                        "cname": "硬碟",
                        "id": "23450"
                    },
                    {
                        "cid": "281",
                        "cname": "SSD",
                        "id": "2084239902"
                    },
                    {
                        "cid": "282",
                        "cname": "记忆卡",
                        "id": "2084039469"
                    },
                    {
                        "cid": "283",
                        "cname": "蓝光光驱",
                        "id": "2084247695"
                    },
                    {
                        "cid": "284",
                        "cname": "DVD驱动器",
                        "id": "2084284892"
                    },
                    {
                        "cid": "285",
                        "cname": "光盘驱动器",
                        "id": "2084284905"
                    },
                    {
                        "cid": "286",
                        "cname": "MO光驱",
                        "id": "2084039601"
                    },
                    {
                        "cid": "287",
                        "cname": "数据存储器",
                        "id": "23451"
                    },
                    {
                        "cid": "288",
                        "cname": "硬盘",
                        "id": "23449"
                    },
                    {
                        "cid": "289",
                        "cname": "显示器",
                        "id": "23563"
                    },
                    {
                        "cid": "290",
                        "cname": "打印机/绘图机",
                        "id": "2084039568"
                    },
                    {
                        "cid": "291",
                        "cname": "多功能一体机",
                        "id": "2084059821"
                    },
                    {
                        "cid": "292",
                        "cname": "网络",
                        "id": "26400"
                    },
                    {
                        "cid": "293",
                        "cname": "输入设备",
                        "id": "2084039607"
                    },
                    {
                        "cid": "294",
                        "cname": "扫描仪",
                        "id": "23440"
                    },
                    {
                        "cid": "295",
                        "cname": "声音",
                        "id": "2084039703"
                    },
                    {
                        "cid": "296",
                        "cname": "数码映像机",
                        "id": "2084039724"
                    },
                    {
                        "cid": "297",
                        "cname": "UPS不间断电源",
                        "id": "2084039702"
                    },
                    {
                        "cid": "298",
                        "cname": "对于Mac",
                        "id": "2084041642"
                    },
                    {
                        "cid": "299",
                        "cname": "工作站用",
                        "id": "2084047094"
                    },
                    {
                        "cid": "300",
                        "cname": "其他",
                        "id": "2084048551"
                    }
                ]
            },
            {
                "cid": "34",
                "cname": "电脑零件",
                "id": "2084039480",
                "children": [
                    {
                        "cid": "1053",
                        "cname": "CPU",
                        "id": "23400"
                    },
                    {
                        "cid": "1054",
                        "cname": "存储器",
                        "id": "2084039543"
                    },
                    {
                        "cid": "1055",
                        "cname": "主板",
                        "id": "2084039547"
                    },
                    {
                        "cid": "1056",
                        "cname": "卡",
                        "id": "2084039481"
                    },
                    {
                        "cid": "1057",
                        "cname": "盒子/箱子",
                        "id": "23457"
                    },
                    {
                        "cid": "1058",
                        "cname": "电源/AC适配器",
                        "id": "23458"
                    },
                    {
                        "cid": "1059",
                        "cname": "电缆/连接器",
                        "id": "23455"
                    },
                    {
                        "cid": "1060",
                        "cname": "对于Mac",
                        "id": "2084041637"
                    },
                    {
                        "cid": "1061",
                        "cname": "Bearbone Kit",
                        "id": "2084047559"
                    },
                    {
                        "cid": "1062",
                        "cname": "工作站用",
                        "id": "2084047096"
                    },
                    {
                        "cid": "1063",
                        "cname": "冷却装置",
                        "id": "2084047828"
                    }
                ]
            },
            {
                "cid": "37",
                "cname": "PDA",
                "id": "23557",
                "children": [
                    {
                        "cid": "1244",
                        "cname": "CLIE",
                        "id": "2084049580"
                    },
                    {
                        "cid": "1245",
                        "cname": "案例用于PDA",
                        "id": "2084049582"
                    },
                    {
                        "cid": "1246",
                        "cname": "Palm Series",
                        "id": "44385"
                    },
                    {
                        "cid": "1247",
                        "cname": "Windows CE",
                        "id": "44389"
                    },
                    {
                        "cid": "1248",
                        "cname": "Zaurus",
                        "id": "2084005095"
                    },
                    {
                        "cid": "1249",
                        "cname": "掌上电子邮件收发器",
                        "id": "2084005096"
                    },
                    {
                        "cid": "1250",
                        "cname": "其他",
                        "id": "44390"
                    }
                ]
            },
            {
                "cid": "38",
                "cname": "便携式掌上电脑",
                "id": "2084039460",
                "children": []
            },
            {
                "cid": "44",
                "cname": "其他",
                "id": "23564",
                "children": []
            }
        ]
    },
    {
        "cid": "2",
        "cname": "家电数码",
        "id": "23632",
        "children": [
            {
                "cid": "1253",
                "cname": "放映机器",
                "id": "23880",
                "children": [
                    {
                        "cid": "1278",
                        "cname": "电视机",
                        "id": "23884"
                    },
                    {
                        "cid": "1279",
                        "cname": "投影仪",
                        "id": "2084018963"
                    },
                    {
                        "cid": "1280",
                        "cname": "蓝光刻录机",
                        "id": "2084230819"
                    },
                    {
                        "cid": "1281",
                        "cname": "蓝光播放器",
                        "id": "2084284115"
                    },
                    {
                        "cid": "1282",
                        "cname": "DVD录像机",
                        "id": "2084048827"
                    },
                    {
                        "cid": "1283",
                        "cname": "DVD Player",
                        "id": "23928"
                    },
                    {
                        "cid": "1284",
                        "cname": "天线",
                        "id": "2084018964"
                    },
                    {
                        "cid": "1285",
                        "cname": "调谐器",
                        "id": "2084018965"
                    },
                    {
                        "cid": "1286",
                        "cname": "记录媒体",
                        "id": "2084239218"
                    },
                    {
                        "cid": "1287",
                        "cname": "映像用电缆",
                        "id": "2084221807"
                    },
                    {
                        "cid": "1288",
                        "cname": "LD 播放器",
                        "id": "23932"
                    },
                    {
                        "cid": "1289",
                        "cname": "摄像机",
                        "id": "23936"
                    },
                    {
                        "cid": "1290",
                        "cname": "录像机",
                        "id": "23900"
                    },
                    {
                        "cid": "1291",
                        "cname": "遥控器",
                        "id": "2084205438"
                    },
                    {
                        "cid": "1292",
                        "cname": "AV放大器",
                        "id": "2084037424"
                    },
                    {
                        "cid": "1293",
                        "cname": "电视机台/ａｖ架",
                        "id": "2084015554"
                    },
                    {
                        "cid": "1294",
                        "cname": "其他",
                        "id": "2084051816"
                    }
                ]
            },
            {
                "cid": "1254",
                "cname": "音响设备",
                "id": "23764",
                "children": [
                    {
                        "cid": "1399",
                        "cname": "便携式播放器",
                        "id": "23848"
                    },
                    {
                        "cid": "1400",
                        "cname": "头载耳机, 耳机",
                        "id": "23804"
                    },
                    {
                        "cid": "1401",
                        "cname": "放大器",
                        "id": "23792"
                    },
                    {
                        "cid": "1402",
                        "cname": "扬声器",
                        "id": "23812"
                    },
                    {
                        "cid": "1403",
                        "cname": "CD唱机",
                        "id": "23772"
                    },
                    {
                        "cid": "1404",
                        "cname": "DJ设备",
                        "id": "2084261081"
                    },
                    {
                        "cid": "1405",
                        "cname": "黑胶机",
                        "id": "23824"
                    },
                    {
                        "cid": "1406",
                        "cname": "系统组成/组件",
                        "id": "23816"
                    },
                    {
                        "cid": "1407",
                        "cname": "音响用电缆",
                        "id": "2084221806"
                    },
                    {
                        "cid": "1408",
                        "cname": "MD 機／錄音機",
                        "id": "2084024097"
                    },
                    {
                        "cid": "1409",
                        "cname": "录音底座",
                        "id": "23832"
                    },
                    {
                        "cid": "1410",
                        "cname": "DAT机",
                        "id": "2084286800"
                    },
                    {
                        "cid": "1411",
                        "cname": "打开卷轴甲板",
                        "id": "2084286799"
                    },
                    {
                        "cid": "1412",
                        "cname": "IC录音笔",
                        "id": "2084024108"
                    },
                    {
                        "cid": "1413",
                        "cname": "无线电广播",
                        "id": "2084024137"
                    },
                    {
                        "cid": "1414",
                        "cname": "电子元件",
                        "id": "2084263358"
                    },
                    {
                        "cid": "1415",
                        "cname": "DTM/DAW设备",
                        "id": "22544"
                    },
                    {
                        "cid": "1416",
                        "cname": "Equalizer",
                        "id": "23800"
                    },
                    {
                        "cid": "1417",
                        "cname": "有声读物",
                        "id": "21608"
                    },
                    {
                        "cid": "1418",
                        "cname": "车载音响",
                        "id": "23852"
                    },
                    {
                        "cid": "1419",
                        "cname": "卡拉 OK机器",
                        "id": "2084048479"
                    },
                    {
                        "cid": "1420",
                        "cname": "调谐器",
                        "id": "23820"
                    },
                    {
                        "cid": "1421",
                        "cname": "麦克风",
                        "id": "2084024007"
                    },
                    {
                        "cid": "1422",
                        "cname": "（音响）记录媒体",
                        "id": "2084024120"
                    },
                    {
                        "cid": "1423",
                        "cname": "杂志",
                        "id": "2084008122"
                    },
                    {
                        "cid": "1424",
                        "cname": "留声机",
                        "id": "2084048439"
                    },
                    {
                        "cid": "1425",
                        "cname": "（音响）遥控器",
                        "id": "2084205443"
                    },
                    {
                        "cid": "1426",
                        "cname": "（音响设备）其他",
                        "id": "23828"
                    }
                ]
            },
            {
                "cid": "1255",
                "cname": "相机/镜头",
                "id": "23636",
                "children": [
                    {
                        "cid": "1626",
                        "cname": "数码相机",
                        "id": "2084261633"
                    },
                    {
                        "cid": "1627",
                        "cname": "胶片相机",
                        "id": "23640"
                    },
                    {
                        "cid": "1628",
                        "cname": "摄像机",
                        "id": "23936"
                    },
                    {
                        "cid": "1629",
                        "cname": "透镜",
                        "id": "23684"
                    },
                    {
                        "cid": "1630",
                        "cname": "妇女装饰品",
                        "id": "23720"
                    },
                    {
                        "cid": "1631",
                        "cname": "记忆卡",
                        "id": "2084039469"
                    },
                    {
                        "cid": "1632",
                        "cname": "数字照片框架",
                        "id": "2084231456"
                    },
                    {
                        "cid": "1633",
                        "cname": "胶卷",
                        "id": "23664"
                    },
                    {
                        "cid": "1634",
                        "cname": "说明书",
                        "id": "2084052265"
                    },
                    {
                        "cid": "1635",
                        "cname": "目录",
                        "id": "2084313032"
                    },
                    {
                        "cid": "1636",
                        "cname": "显微镜",
                        "id": "2084045044"
                    },
                    {
                        "cid": "1637",
                        "cname": "双筒望远镜",
                        "id": "2084045042"
                    },
                    {
                        "cid": "1638",
                        "cname": "歌剧眼镜",
                        "id": "2084263454"
                    },
                    {
                        "cid": "1639",
                        "cname": "单片眼镜",
                        "id": "2084263446"
                    },
                    {
                        "cid": "1640",
                        "cname": "望远镜",
                        "id": "2084045043"
                    },
                    {
                        "cid": "1641",
                        "cname": "书",
                        "id": "2084009064"
                    },
                    {
                        "cid": "1642",
                        "cname": "照片制作",
                        "id": "2084307731"
                    },
                    {
                        "cid": "1643",
                        "cname": "相机出租",
                        "id": "2084307785"
                    }
                ]
            },
            {
                "cid": "1256",
                "cname": "手机/配件",
                "id": "23960",
                "children": [
                    {
                        "cid": "1869",
                        "cname": "移动装置",
                        "id": "2084298965"
                    },
                    {
                        "cid": "1870",
                        "cname": "手机",
                        "id": "2084005067"
                    },
                    {
                        "cid": "1871",
                        "cname": "小灵通体",
                        "id": "2084005068"
                    },
                    {
                        "cid": "1872",
                        "cname": "摄像机用",
                        "id": "2084005063"
                    },
                    {
                        "cid": "1873",
                        "cname": "妇女装饰品",
                        "id": "2084005061"
                    },
                    {
                        "cid": "1874",
                        "cname": "模拟式",
                        "id": "2084008420"
                    },
                    {
                        "cid": "1875",
                        "cname": "平板设备",
                        "id": "2084292086"
                    },
                    {
                        "cid": "1876",
                        "cname": "头载耳机, 耳机",
                        "id": "23804"
                    },
                    {
                        "cid": "1877",
                        "cname": "其他",
                        "id": "2084005066"
                    }
                ]
            },
            {
                "cid": "1257",
                "cname": "监控",
                "id": "2084055703",
                "children": []
            },
            {
                "cid": "1262",
                "cname": "美容/健康",
                "id": "2084042673",
                "children": [
                    {
                        "cid": "2286",
                        "cname": "足浴",
                        "id": "2084063421"
                    },
                    {
                        "cid": "2287",
                        "cname": "整发器",
                        "id": "2084044961"
                    },
                    {
                        "cid": "2288",
                        "cname": "卷发",
                        "id": "2084044962"
                    },
                    {
                        "cid": "2289",
                        "cname": "吹风机(头发)",
                        "id": "2084044960"
                    },
                    {
                        "cid": "2290",
                        "cname": "按摩器",
                        "id": "2084006905"
                    },
                    {
                        "cid": "2291",
                        "cname": "体脂肪计",
                        "id": "2084006921"
                    },
                    {
                        "cid": "2292",
                        "cname": "电动剃须刀",
                        "id": "2084044963"
                    },
                    {
                        "cid": "2293",
                        "cname": "电动牙刷",
                        "id": "2084044972"
                    },
                    {
                        "cid": "2294",
                        "cname": "电器用品",
                        "id": "2084007477"
                    },
                    {
                        "cid": "2295",
                        "cname": "其他",
                        "id": "2084042674"
                    }
                ]
            },
            {
                "cid": "1263",
                "cname": "电话/传真",
                "id": "2084042672",
                "children": [
                    {
                        "cid": "2332",
                        "cname": "一般手机",
                        "id": "23956"
                    },
                    {
                        "cid": "2333",
                        "cname": "传真电话",
                        "id": "2084032436"
                    },
                    {
                        "cid": "2334",
                        "cname": "手机/小灵通",
                        "id": "23960"
                    },
                    {
                        "cid": "2335",
                        "cname": "语音信箱",
                        "id": "2084032435"
                    },
                    {
                        "cid": "2336",
                        "cname": "可视电话",
                        "id": "2084048549"
                    },
                    {
                        "cid": "2337",
                        "cname": "商用电话",
                        "id": "2084198552"
                    },
                    {
                        "cid": "2338",
                        "cname": "外部设备",
                        "id": "2084032434"
                    },
                    {
                        "cid": "2339",
                        "cname": "多功能机/复印机",
                        "id": "22916"
                    },
                    {
                        "cid": "2340",
                        "cname": "电话卡",
                        "id": "23968"
                    }
                ]
            },
            
            {
                "cid": "1267",
                "cname": "计算器",
                "id": "23878",
                "children": [
                    {
                        "cid": "44258",
                        "cname": "amadana",
                        "id": "2084239841"
                    },
                    {
                        "cid": "44259",
                        "cname": "卡西欧",
                        "id": "2084239839"
                    },
                    {
                        "cid": "44260",
                        "cname": "Citizen",
                        "id": "2084239840"
                    },
                    {
                        "cid": "44261",
                        "cname": "声宝",
                        "id": "2084239838"
                    },
                    {
                        "cid": "44262",
                        "cname": "其他",
                        "id": "2084239842"
                    }
                ]
            },
            {
                "cid": "1268",
                "cname": "电池/充电器",
                "id": "2084044953",
                "children": [
                    {
                        "cid": "2341",
                        "cname": "一般",
                        "id": "2084044954"
                    },
                    {
                        "cid": "2342",
                        "cname": "碱干电池",
                        "id": "2084226888"
                    },
                    {
                        "cid": "2343",
                        "cname": "充电池子",
                        "id": "2084226883"
                    },
                    {
                        "cid": "2344",
                        "cname": "太阳能电池板/太阳能",
                        "id": "2084258410"
                    },
                    {
                        "cid": "2345",
                        "cname": "摄像机",
                        "id": "2084018952"
                    },
                    {
                        "cid": "2346",
                        "cname": "手机小灵通",
                        "id": "2084005063"
                    },
                    {
                        "cid": "2347",
                        "cname": "手表的电池",
                        "id": "2084062491"
                    }
                ]
            },
            {
                "cid": "1269",
                "cname": "变压器/适配器",
                "id": "2084044958",
                "children": []
            },
            {
                "cid": "1270",
                "cname": "电子元件",
                "id": "2084263358",
                "children": [
                    {
                        "cid": "2355",
                        "cname": "LED",
                        "id": "2084263362"
                    },
                    {
                        "cid": "2356",
                        "cname": "线圈",
                        "id": "2084263371"
                    },
                    {
                        "cid": "2357",
                        "cname": "电容器",
                        "id": "2084263359"
                    },
                    {
                        "cid": "2358",
                        "cname": "可变电阻",
                        "id": "2084263365"
                    },
                    {
                        "cid": "2359",
                        "cname": "固定电阻",
                        "id": "2084263364"
                    },
                    {
                        "cid": "2360",
                        "cname": "开关",
                        "id": "2084263366"
                    },
                    {
                        "cid": "2361",
                        "cname": "开关电源",
                        "id": "2084263367"
                    },
                    {
                        "cid": "2362",
                        "cname": "二极管",
                        "id": "2084263361"
                    },
                    {
                        "cid": "2363",
                        "cname": "晶体管",
                        "id": "2084263360"
                    },
                    {
                        "cid": "2364",
                        "cname": "压敏电阻",
                        "id": "2084263363"
                    },
                    {
                        "cid": "2365",
                        "cname": "散热器",
                        "id": "2084263370"
                    },
                    {
                        "cid": "2366",
                        "cname": "休斯",
                        "id": "2084263368"
                    },
                    {
                        "cid": "2367",
                        "cname": "印刷电路板",
                        "id": "2084263373"
                    },
                    {
                        "cid": "2368",
                        "cname": "仪表",
                        "id": "2084263369"
                    },
                    {
                        "cid": "2369",
                        "cname": "继电器",
                        "id": "2084263372"
                    },
                    {
                        "cid": "2370",
                        "cname": "连接器",
                        "id": "2084282461"
                    },
                    {
                        "cid": "2371",
                        "cname": "扬声器",
                        "id": "2084286804"
                    },
                    {
                        "cid": "2372",
                        "cname": "拾音器",
                        "id": "2084286805"
                    },
                    {
                        "cid": "2373",
                        "cname": "集成电路",
                        "id": "2084286803"
                    },
                    {
                        "cid": "2374",
                        "cname": "接线端子",
                        "id": "2084286802"
                    },
                    {
                        "cid": "2375",
                        "cname": "其他",
                        "id": "2084263374"
                    }
                ]
            },
            {
                "cid": "1271",
                "cname": "电视游戏",
                "id": "22844",
                "children": [
                    {
                        "cid": "8401",
                        "cname": "Nintendo Switch",
                        "id": "2084315793"
                    },
                    {
                        "cid": "8402",
                        "cname": "任天堂经典迷你",
                        "id": "2084315791"
                    },
                    {
                        "cid": "8403",
                        "cname": "任天堂3DS",
                        "id": "2084290226"
                    },
                    {
                        "cid": "8404",
                        "cname": "任天堂DS",
                        "id": "2084056539"
                    },
                    {
                        "cid": "8405",
                        "cname": "Wii U",
                        "id": "2084310052"
                    },
                    {
                        "cid": "8406",
                        "cname": "Wii",
                        "id": "2084217064"
                    },
                    {
                        "cid": "8407",
                        "cname": "PS Vita",
                        "id": "2084301277"
                    },
                    {
                        "cid": "8408",
                        "cname": "PSP（PlayStation Portable）",
                        "id": "2084057109"
                    },
                    {
                        "cid": "8409",
                        "cname": "PlayStation 4",
                        "id": "2084313826"
                    },
                    {
                        "cid": "8410",
                        "cname": "PlayStation 3",
                        "id": "2084216435"
                    },
                    {
                        "cid": "8411",
                        "cname": "PlayStation 2",
                        "id": "2084006668"
                    },
                    {
                        "cid": "8412",
                        "cname": "Xbox One",
                        "id": "2084314664"
                    },
                    {
                        "cid": "8413",
                        "cname": "Xbox 360",
                        "id": "2084235546"
                    },
                    {
                        "cid": "8414",
                        "cname": "PlayStation",
                        "id": "22860"
                    },
                    {
                        "cid": "8415",
                        "cname": "GBA",
                        "id": "2084041580"
                    },
                    {
                        "cid": "8416",
                        "cname": "GAMEBOY micro",
                        "id": "2084063616"
                    },
                    {
                        "cid": "8417",
                        "cname": "GAMEBOY",
                        "id": "27812"
                    },
                    {
                        "cid": "8418",
                        "cname": "GAMECUBE",
                        "id": "2084045784"
                    },
                    {
                        "cid": "8419",
                        "cname": "NINTENDO 64",
                        "id": "22850"
                    },
                    {
                        "cid": "8420",
                        "cname": "超级任天堂",
                        "id": "22852"
                    },
                    {
                        "cid": "8421",
                        "cname": "FC",
                        "id": "22853"
                    },
                    {
                        "cid": "8422",
                        "cname": "Xbox",
                        "id": "2084047852"
                    },
                    {
                        "cid": "8423",
                        "cname": "世嘉",
                        "id": "40505"
                    },
                    {
                        "cid": "8424",
                        "cname": "NEOGEO",
                        "id": "2084005537"
                    },
                    {
                        "cid": "8425",
                        "cname": "3DO",
                        "id": "2084005532"
                    },
                    {
                        "cid": "8426",
                        "cname": "NEC",
                        "id": "2084006676"
                    },
                    {
                        "cid": "8427",
                        "cname": "便携式",
                        "id": "22864"
                    },
                    {
                        "cid": "8428",
                        "cname": "街机游戏",
                        "id": "2084047781"
                    },
                    {
                        "cid": "8429",
                        "cname": "Avatar",
                        "id": "2084237380"
                    },
                    {
                        "cid": "8430",
                        "cname": "游戏音乐",
                        "id": "2084005147"
                    },
                    {
                        "cid": "8431",
                        "cname": "游戏攻略",
                        "id": "2084009067"
                    },
                    {
                        "cid": "8432",
                        "cname": "游戏",
                        "id": "2084047654"
                    },
                    {
                        "cid": "8433",
                        "cname": "电视游戏",
                        "id": "2084005119"
                    },
                    {
                        "cid": "8434",
                        "cname": "其他",
                        "id": "22892"
                    }
                ]
            },
            {
                "cid": "1273",
                "cname": "家用电子产品",
                "id": "24466",
                "children": [
                    {
                        "cid": "2376",
                        "cname": "熨斗",
                        "id": "2084008355"
                    },
                    {
                        "cid": "2377",
                        "cname": "音响设备",
                        "id": "23764"
                    },
                    {
                        "cid": "2378",
                        "cname": "厨房用品, 食卓",
                        "id": "2084008364"
                    },
                    {
                        "cid": "2379",
                        "cname": "电视机",
                        "id": "23884"
                    },
                    {
                        "cid": "2380",
                        "cname": "录像机",
                        "id": "23900"
                    },
                    {
                        "cid": "2381",
                        "cname": "吹风机(头发)",
                        "id": "2084044960"
                    },
                    {
                        "cid": "2382",
                        "cname": "缝纫机",
                        "id": "2084008354"
                    },
                    {
                        "cid": "2383",
                        "cname": "放映机器",
                        "id": "23880"
                    },
                    {
                        "cid": "2384",
                        "cname": "干燥机",
                        "id": "24442"
                    },
                    {
                        "cid": "2385",
                        "cname": "照明设备",
                        "id": "24690"
                    },
                    {
                        "cid": "2386",
                        "cname": "洗衣机",
                        "id": "24454"
                    },
                    {
                        "cid": "2387",
                        "cname": "吸尘器",
                        "id": "24450"
                    },
                    {
                        "cid": "2388",
                        "cname": "电话/传真",
                        "id": "2084042672"
                    },
                    {
                        "cid": "2389",
                        "cname": "冷暖房/空调",
                        "id": "2084008356"
                    },
                    {
                        "cid": "2390",
                        "cname": "其他",
                        "id": "2084061709"
                    }
                ]
            },
            {
                "cid": "1274",
                "cname": "照明设备",
                "id": "24690",
                "children": [
                    {
                        "cid": "42690",
                        "cname": "荧光灯,电灯泡",
                        "id": "2084057374"
                    },
                    {
                        "cid": "42691",
                        "cname": "在天花板上的灯",
                        "id": "2084007892"
                    },
                    {
                        "cid": "42692",
                        "cname": "大型落地座灯",
                        "id": "2084007891"
                    },
                    {
                        "cid": "42693",
                        "cname": "桌上型/台式",
                        "id": "2084007890"
                    },
                    {
                        "cid": "42694",
                        "cname": "台灯",
                        "id": "2084047858"
                    },
                    {
                        "cid": "42695",
                        "cname": "方形纸罩座灯",
                        "id": "2084049719"
                    },
                    {
                        "cid": "42696",
                        "cname": "香熏",
                        "id": "2084213841"
                    },
                    {
                        "cid": "42697",
                        "cname": "室外用电灯",
                        "id": "2084057373"
                    },
                    {
                        "cid": "42698",
                        "cname": "照明",
                        "id": "2084047055"
                    },
                    {
                        "cid": "42699",
                        "cname": "花园装饰灯",
                        "id": "2084047047"
                    },
                    {
                        "cid": "42700",
                        "cname": "附感应器照明灯",
                        "id": "2084055705"
                    },
                    {
                        "cid": "42701",
                        "cname": "特殊用",
                        "id": "2084062682"
                    },
                    {
                        "cid": "42702",
                        "cname": "线路导管轨道",
                        "id": "2084057375"
                    },
                    {
                        "cid": "42703",
                        "cname": "电缆导管用照明",
                        "id": "2084057370"
                    },
                    {
                        "cid": "42704",
                        "cname": "聚光灯/投射灯＠",
                        "id": "2084057371"
                    },
                    {
                        "cid": "42705",
                        "cname": "其他",
                        "id": "2084007893"
                    }
                ]
            },
            {
                "cid": "1277",
                "cname": "其他",
                "id": "23972",
                "children": []
            }
        ]
    },
    {
        "cid": "3",
        "cname": "音乐唱片",
        "id": "22152",
        "children": [
            {
                "cid": "2401",
                "cname": "CD",
                "id": "22192",
                "children": [
                    {
                        "cid": "2414",
                        "cname": "日本流行歌曲",
                        "id": "2084005055"
                    },
                    {
                        "cid": "2415",
                        "cname": "摇滚/流行音乐（西洋）",
                        "id": "22196"
                    },
                    {
                        "cid": "2416",
                        "cname": "CD",
                        "id": "22228"
                    },
                    {
                        "cid": "2417",
                        "cname": "动画影片歌曲",
                        "id": "2084005149"
                    },
                    {
                        "cid": "2418",
                        "cname": "爵士音乐",
                        "id": "22208"
                    },
                    {
                        "cid": "2419",
                        "cname": "古典",
                        "id": "22232"
                    },
                    {
                        "cid": "2420",
                        "cname": "世界音乐合集",
                        "id": "22212"
                    },
                    {
                        "cid": "2421",
                        "cname": "游戏音乐",
                        "id": "2084005147"
                    },
                    {
                        "cid": "2422",
                        "cname": "俱乐部/舞蹈",
                        "id": "2084006949"
                    },
                    {
                        "cid": "2423",
                        "cname": "R&B、灵魂音乐",
                        "id": "22216"
                    },
                    {
                        "cid": "2424",
                        "cname": "说唱,街舞 ",
                        "id": "22220"
                    },
                    {
                        "cid": "2425",
                        "cname": "电视连续剧原声集",
                        "id": "2084047455"
                    },
                    {
                        "cid": "2426",
                        "cname": "治疗新时代",
                        "id": "2084256921"
                    },
                    {
                        "cid": "2427",
                        "cname": "布鲁斯",
                        "id": "2084005264"
                    },
                    {
                        "cid": "2428",
                        "cname": "演歌",
                        "id": "2084044749"
                    },
                    {
                        "cid": "2429",
                        "cname": "演艺,相声",
                        "id": "2084047957"
                    },
                    {
                        "cid": "2430",
                        "cname": "宗教",
                        "id": "2084047840"
                    },
                    {
                        "cid": "2431",
                        "cname": "童谣/教育",
                        "id": "22236"
                    },
                    {
                        "cid": "2432",
                        "cname": "读",
                        "id": "2084256906"
                    },
                    {
                        "cid": "2433",
                        "cname": "书的CD",
                        "id": "2084047451"
                    },
                    {
                        "cid": "2434",
                        "cname": "（CD）其他",
                        "id": "22240"
                    }
                ]
            },
            {
                "cid": "2402",
                "cname": "唱片",
                "id": "22260",
                "children": [
                    {
                        "cid": "3788",
                        "cname": "R&B、灵魂音乐",
                        "id": "22284"
                    },
                    {
                        "cid": "3789",
                        "cname": "动画影片歌曲",
                        "id": "2084007037"
                    },
                    {
                        "cid": "3790",
                        "cname": "古典",
                        "id": "22300"
                    },
                    {
                        "cid": "3791",
                        "cname": "俱乐部/舞蹈",
                        "id": "2084007035"
                    },
                    {
                        "cid": "3792",
                        "cname": "音乐游戏",
                        "id": "2084007038"
                    },
                    {
                        "cid": "3793",
                        "cname": "爵士音乐",
                        "id": "22276"
                    },
                    {
                        "cid": "3794",
                        "cname": "日本流行歌曲",
                        "id": "2084005056"
                    },
                    {
                        "cid": "3795",
                        "cname": "治疗新时代",
                        "id": "2084258238"
                    },
                    {
                        "cid": "3796",
                        "cname": "布鲁斯",
                        "id": "2084005265"
                    },
                    {
                        "cid": "3797",
                        "cname": "说唱,街舞 ",
                        "id": "22288"
                    },
                    {
                        "cid": "3798",
                        "cname": "Reggae",
                        "id": "2084048577"
                    },
                    {
                        "cid": "3799",
                        "cname": "摇滚/流行音乐（西洋）",
                        "id": "22264"
                    },
                    {
                        "cid": "3800",
                        "cname": "世界音乐合集",
                        "id": "22280"
                    },
                    {
                        "cid": "3801",
                        "cname": "CD",
                        "id": "22296"
                    },
                    {
                        "cid": "3802",
                        "cname": "演歌",
                        "id": "2084044750"
                    },
                    {
                        "cid": "3803",
                        "cname": "童谣/教育",
                        "id": "22304"
                    },
                    {
                        "cid": "3804",
                        "cname": "其他",
                        "id": "22308"
                    }
                ]
            },
            {
                "cid": "2403",
                "cname": "磁带",
                "id": "22344",
                "children": [
                    {
                        "cid": "4435",
                        "cname": "R&B、灵魂音乐",
                        "id": "22368"
                    },
                    {
                        "cid": "4436",
                        "cname": "动画影片歌曲",
                        "id": "2084006987"
                    },
                    {
                        "cid": "4437",
                        "cname": "古典",
                        "id": "22384"
                    },
                    {
                        "cid": "4438",
                        "cname": "俱乐部/舞蹈",
                        "id": "2084006986"
                    },
                    {
                        "cid": "4439",
                        "cname": "音乐游戏",
                        "id": "2084006988"
                    },
                    {
                        "cid": "4440",
                        "cname": "爵士音乐",
                        "id": "22360"
                    },
                    {
                        "cid": "4441",
                        "cname": "日本流行歌曲",
                        "id": "2084005445"
                    },
                    {
                        "cid": "4442",
                        "cname": "布鲁斯",
                        "id": "2084005266"
                    },
                    {
                        "cid": "4443",
                        "cname": "说唱,街舞 ",
                        "id": "22372"
                    },
                    {
                        "cid": "4444",
                        "cname": "摇滚/流行音乐（西洋）",
                        "id": "22348"
                    },
                    {
                        "cid": "4445",
                        "cname": "世界音乐合集",
                        "id": "22364"
                    },
                    {
                        "cid": "4446",
                        "cname": "CD",
                        "id": "22380"
                    },
                    {
                        "cid": "4447",
                        "cname": "童谣/教育",
                        "id": "22388"
                    },
                    {
                        "cid": "4448",
                        "cname": "（音乐磁带）其他",
                        "id": "22392"
                    }
                ]
            },
            {
                "cid": "2404",
                "cname": "DVD",
                "id": "2084046929",
                "children": [
                    {
                        "cid": "4458",
                        "cname": "日本流行歌曲",
                        "id": "2084041520"
                    },
                    {
                        "cid": "4459",
                        "cname": "摇滚/流行音乐（西洋）",
                        "id": "2084041521"
                    },
                    {
                        "cid": "4460",
                        "cname": "爵士音乐",
                        "id": "2084048523"
                    },
                    {
                        "cid": "4461",
                        "cname": "古典",
                        "id": "2084049856"
                    },
                    {
                        "cid": "4462",
                        "cname": "其他",
                        "id": "2084041526"
                    }
                ]
            },
            {
                "cid": "2405",
                "cname": "蓝光",
                "id": "2084249081",
                "children": [
                    {
                        "cid": "4463",
                        "cname": "J - POP",
                        "id": "2084249082"
                    },
                    {
                        "cid": "4464",
                        "cname": "洋乐",
                        "id": "2084249083"
                    },
                    {
                        "cid": "4465",
                        "cname": "古典",
                        "id": "2084249084"
                    },
                    {
                        "cid": "4466",
                        "cname": "爵士音乐",
                        "id": "2084249085"
                    },
                    {
                        "cid": "4467",
                        "cname": "音乐剧",
                        "id": "2084249087"
                    },
                    {
                        "cid": "4468",
                        "cname": "其他",
                        "id": "2084249086"
                    }
                ]
            },
            {
                "cid": "2406",
                "cname": "录像带",
                "id": "22244",
                "children": [
                    {
                        "cid": "4469",
                        "cname": "R&B、灵魂音乐",
                        "id": "2084006999"
                    },
                    {
                        "cid": "4470",
                        "cname": "动画影片歌曲",
                        "id": "2084006997"
                    },
                    {
                        "cid": "4471",
                        "cname": "古典",
                        "id": "2084007000"
                    },
                    {
                        "cid": "4472",
                        "cname": "俱乐部/舞蹈",
                        "id": "2084006995"
                    },
                    {
                        "cid": "4473",
                        "cname": "音乐游戏",
                        "id": "2084006998"
                    },
                    {
                        "cid": "4474",
                        "cname": "爵士音乐",
                        "id": "2084007001"
                    },
                    {
                        "cid": "4475",
                        "cname": "日本流行歌曲",
                        "id": "2084005081"
                    },
                    {
                        "cid": "4476",
                        "cname": "布鲁斯",
                        "id": "2084007002"
                    },
                    {
                        "cid": "4477",
                        "cname": "说唱,街舞 ",
                        "id": "2084007003"
                    },
                    {
                        "cid": "4478",
                        "cname": "摇滚/流行音乐（西洋）",
                        "id": "22248"
                    },
                    {
                        "cid": "4479",
                        "cname": "世界音乐合集",
                        "id": "2084007004"
                    },
                    {
                        "cid": "4480",
                        "cname": "CD",
                        "id": "2084006996"
                    },
                    {
                        "cid": "4481",
                        "cname": "童谣/教育",
                        "id": "2084007005"
                    },
                    {
                        "cid": "4482",
                        "cname": "其他",
                        "id": "22256"
                    }
                ]
            },
            {
                "cid": "2407",
                "cname": "激光光盘",
                "id": "2084005202",
                "children": [
                    {
                        "cid": "4667",
                        "cname": "R&B、灵魂音乐",
                        "id": "2084007016"
                    },
                    {
                        "cid": "4668",
                        "cname": "动画影片歌曲",
                        "id": "2084007014"
                    },
                    {
                        "cid": "4669",
                        "cname": "古典",
                        "id": "2084005538"
                    },
                    {
                        "cid": "4670",
                        "cname": "俱乐部/舞蹈",
                        "id": "2084007012"
                    },
                    {
                        "cid": "4671",
                        "cname": "音乐游戏",
                        "id": "2084007015"
                    },
                    {
                        "cid": "4672",
                        "cname": "爵士音乐",
                        "id": "2084005539"
                    },
                    {
                        "cid": "4673",
                        "cname": "日本流行歌曲",
                        "id": "2084005540"
                    },
                    {
                        "cid": "4674",
                        "cname": "布鲁斯",
                        "id": "2084007017"
                    },
                    {
                        "cid": "4675",
                        "cname": "说唱,街舞 ",
                        "id": "2084007018"
                    },
                    {
                        "cid": "4676",
                        "cname": "摇滚/流行音乐（西洋）",
                        "id": "2084005541"
                    },
                    {
                        "cid": "4677",
                        "cname": "世界音乐合集",
                        "id": "2084007019"
                    },
                    {
                        "cid": "4678",
                        "cname": "CD",
                        "id": "2084007013"
                    },
                    {
                        "cid": "4679",
                        "cname": "童谣/教育",
                        "id": "2084007020"
                    },
                    {
                        "cid": "4680",
                        "cname": "其他",
                        "id": "2084005542"
                    }
                ]
            },
            {
                "cid": "2408",
                "cname": "SP盘",
                "id": "2084224176",
                "children": [
                    {
                        "cid": "10847",
                        "cname": "古典音乐",
                        "id": "2084224178"
                    },
                    {
                        "cid": "10848",
                        "cname": "爵士",
                        "id": "2084224179"
                    },
                    {
                        "cid": "10849",
                        "cname": "其他",
                        "id": "2084224180"
                    }
                ]
            },
            {
                "cid": "2409",
                "cname": "乐器/器材",
                "id": "22436",
                "children": [
                    {
                        "cid": "9168",
                        "cname": "吉他",
                        "id": "22476"
                    },
                    {
                        "cid": "9169",
                        "cname": "基地",
                        "id": "22480"
                    },
                    {
                        "cid": "9170",
                        "cname": "弦乐器",
                        "id": "22572"
                    },
                    {
                        "cid": "9171",
                        "cname": "管乐器",
                        "id": "22440"
                    },
                    {
                        "cid": "9172",
                        "cname": "键盘乐器",
                        "id": "22532"
                    },
                    {
                        "cid": "9173",
                        "cname": "打击乐器",
                        "id": "22500"
                    },
                    {
                        "cid": "9174",
                        "cname": "传统日本乐器",
                        "id": "2084305860"
                    },
                    {
                        "cid": "9175",
                        "cname": "乐高竞赛",
                        "id": "2084019010"
                    },
                    {
                        "cid": "9176",
                        "cname": "DJ设备",
                        "id": "2084261081"
                    },
                    {
                        "cid": "9177",
                        "cname": "DTM/DAW",
                        "id": "22544"
                    },
                    {
                        "cid": "9178",
                        "cname": "放大器",
                        "id": "2084005286"
                    },
                    {
                        "cid": "9179",
                        "cname": "节拍器",
                        "id": "2084210466"
                    },
                    {
                        "cid": "9180",
                        "cname": "谱架",
                        "id": "2084210467"
                    },
                    {
                        "cid": "9181",
                        "cname": "隔音产品",
                        "id": "2084285349"
                    },
                    {
                        "cid": "9182",
                        "cname": "乐器玩具",
                        "id": "2084024191"
                    },
                    {
                        "cid": "9183",
                        "cname": "乐谱",
                        "id": "2084009086"
                    },
                    {
                        "cid": "9184",
                        "cname": "录音/音乐制作",
                        "id": "2084307734"
                    },
                    {
                        "cid": "9185",
                        "cname": "乐器修理/改造",
                        "id": "2084307822"
                    },
                    {
                        "cid": "9186",
                        "cname": "仪器的经验教训",
                        "id": "2084307743"
                    },
                    {
                        "cid": "9187",
                        "cname": "乐器租赁",
                        "id": "2084307790"
                    },
                    {
                        "cid": "9188",
                        "cname": "其他",
                        "id": "22656"
                    }
                ]
            },
            {
                "cid": "2411",
                "cname": "书/杂志",
                "id": "21788",
                "children": [
                    {
                        "cid": "6376",
                        "cname": "音乐评论",
                        "id": "2084009079"
                    },
                    {
                        "cid": "6377",
                        "cname": "乐谱",
                        "id": "2084009086"
                    },
                    {
                        "cid": "6378",
                        "cname": "音乐教育,指导",
                        "id": "2084009077"
                    },
                    {
                        "cid": "6379",
                        "cname": "卡拉OK/歌曲集",
                        "id": "2084009078"
                    },
                    {
                        "cid": "6380",
                        "cname": "音乐家的书",
                        "id": "2084009110"
                    },
                    {
                        "cid": "6381",
                        "cname": "杂志",
                        "id": "21936"
                    }
                ]
            },
            {
                "cid": "2412",
                "cname": "音乐家周边商品",
                "id": "22396",
                "children": [
                    {
                        "cid": "4690",
                        "cname": "T恤",
                        "id": "2084049663"
                    },
                    {
                        "cid": "4691",
                        "cname": "音乐家",
                        "id": "2084047084"
                    },
                    {
                        "cid": "4692",
                        "cname": "音乐家",
                        "id": "2084006163"
                    },
                    {
                        "cid": "4693",
                        "cname": "签名",
                        "id": "2084005082"
                    },
                    {
                        "cid": "4694",
                        "cname": "音乐家",
                        "id": "42206"
                    },
                    {
                        "cid": "4695",
                        "cname": "音乐家",
                        "id": "2084006177"
                    },
                    {
                        "cid": "4696",
                        "cname": "公共电话卡",
                        "id": "2084005105"
                    },
                    {
                        "cid": "4697",
                        "cname": "宣传册",
                        "id": "2084047078"
                    },
                    {
                        "cid": "4698",
                        "cname": "歌迷俱乐部会刊",
                        "id": "2084047090"
                    },
                    {
                        "cid": "4699",
                        "cname": "音乐家",
                        "id": "2084005085"
                    },
                    {
                        "cid": "4700",
                        "cname": "流行音乐",
                        "id": "2084047087"
                    },
                    {
                        "cid": "4701",
                        "cname": "另一个音乐家",
                        "id": "2084024931"
                    },
                    {
                        "cid": "4702",
                        "cname": "链",
                        "id": "2084040530"
                    },
                    {
                        "cid": "4703",
                        "cname": "写真照",
                        "id": "2084047080"
                    },
                    {
                        "cid": "4704",
                        "cname": "写真集",
                        "id": "2084006192"
                    },
                    {
                        "cid": "4705",
                        "cname": "音乐家",
                        "id": "2084006164"
                    },
                    {
                        "cid": "4706",
                        "cname": "（音乐纪念品）其他",
                        "id": "2084005353"
                    }
                ]
            },
            {
                "cid": "2413",
                "cname": "音乐制作",
                "id": "2084307734",
                "children": []
            }
        ]
    },
    {
        "cid": "6",
        "cname": "玩具/游戏",
        "id": "25464",
        "children": [
            {
                "cid": "7260",
                "cname": "电视游戏",
                "id": "22844",
                "children": [
                    {
                        "cid": "8401",
                        "cname": "Nintendo Switch",
                        "id": "2084315793"
                    },
                    {
                        "cid": "8402",
                        "cname": "任天堂经典迷你",
                        "id": "2084315791"
                    },
                    {
                        "cid": "8403",
                        "cname": "任天堂3DS",
                        "id": "2084290226"
                    },
                    {
                        "cid": "8404",
                        "cname": "任天堂DS",
                        "id": "2084056539"
                    },
                    {
                        "cid": "8405",
                        "cname": "Wii U",
                        "id": "2084310052"
                    },
                    {
                        "cid": "8406",
                        "cname": "Wii",
                        "id": "2084217064"
                    },
                    {
                        "cid": "8407",
                        "cname": "PS Vita",
                        "id": "2084301277"
                    },
                    {
                        "cid": "8408",
                        "cname": "PSP（PlayStation Portable）",
                        "id": "2084057109"
                    },
                    {
                        "cid": "8409",
                        "cname": "PlayStation 4",
                        "id": "2084313826"
                    },
                    {
                        "cid": "8410",
                        "cname": "PlayStation 3",
                        "id": "2084216435"
                    },
                    {
                        "cid": "8411",
                        "cname": "PlayStation 2",
                        "id": "2084006668"
                    },
                    {
                        "cid": "8412",
                        "cname": "Xbox One",
                        "id": "2084314664"
                    },
                    {
                        "cid": "8413",
                        "cname": "Xbox 360",
                        "id": "2084235546"
                    },
                    {
                        "cid": "8414",
                        "cname": "PlayStation",
                        "id": "22860"
                    },
                    {
                        "cid": "8415",
                        "cname": "GBA",
                        "id": "2084041580"
                    },
                    {
                        "cid": "8416",
                        "cname": "GAMEBOY micro",
                        "id": "2084063616"
                    },
                    {
                        "cid": "8417",
                        "cname": "GAMEBOY",
                        "id": "27812"
                    },
                    {
                        "cid": "8418",
                        "cname": "GAMECUBE",
                        "id": "2084045784"
                    },
                    {
                        "cid": "8419",
                        "cname": "NINTENDO 64",
                        "id": "22850"
                    },
                    {
                        "cid": "8420",
                        "cname": "超级任天堂",
                        "id": "22852"
                    },
                    {
                        "cid": "8421",
                        "cname": "FC",
                        "id": "22853"
                    },
                    {
                        "cid": "8422",
                        "cname": "Xbox",
                        "id": "2084047852"
                    },
                    {
                        "cid": "8423",
                        "cname": "世嘉",
                        "id": "40505"
                    },
                    {
                        "cid": "8424",
                        "cname": "NEOGEO",
                        "id": "2084005537"
                    },
                    {
                        "cid": "8425",
                        "cname": "3DO",
                        "id": "2084005532"
                    },
                    {
                        "cid": "8426",
                        "cname": "NEC",
                        "id": "2084006676"
                    },
                    {
                        "cid": "8427",
                        "cname": "便携式",
                        "id": "22864"
                    },
                    {
                        "cid": "8428",
                        "cname": "街机游戏",
                        "id": "2084047781"
                    },
                    {
                        "cid": "8429",
                        "cname": "Avatar",
                        "id": "2084237380"
                    },
                    {
                        "cid": "8430",
                        "cname": "游戏音乐",
                        "id": "2084005147"
                    },
                    {
                        "cid": "8431",
                        "cname": "游戏攻略",
                        "id": "2084009067"
                    },
                    {
                        "cid": "8432",
                        "cname": "游戏",
                        "id": "2084047654"
                    },
                    {
                        "cid": "8433",
                        "cname": "电视游戏",
                        "id": "2084005119"
                    },
                    {
                        "cid": "8434",
                        "cname": "其他",
                        "id": "22892"
                    }
                ]
            },
            {
                "cid": "7261",
                "cname": "游戏卡片",
                "id": "25826",
                "children": [
                    {
                        "cid": "8728",
                        "cname": "偶像活动",
                        "id": "2084310653"
                    },
                    {
                        "cid": "8729",
                        "cname": "OWNERS HORSE",
                        "id": "2084309046"
                    },
                    {
                        "cid": "8730",
                        "cname": "偶像宣言",
                        "id": "2084226772"
                    },
                    {
                        "cid": "8731",
                        "cname": "卡片战斗先导者",
                        "id": "2084301203"
                    },
                    {
                        "cid": "8732",
                        "cname": "高达战争",
                        "id": "2084006019"
                    },
                    {
                        "cid": "8733",
                        "cname": "高达试者",
                        "id": "2084305402"
                    },
                    {
                        "cid": "8734",
                        "cname": "KING OF PRO-WRESTLING",
                        "id": "2084310654"
                    },
                    {
                        "cid": "8735",
                        "cname": "Crusade",
                        "id": "2084258752"
                    },
                    {
                        "cid": "8736",
                        "cname": "蒙面超人 Rider Battle: Ganbaride",
                        "id": "2084239873"
                    },
                    {
                        "cid": "8737",
                        "cname": "Z/X",
                        "id": "2084309073"
                    },
                    {
                        "cid": "8738",
                        "cname": "超级战队",
                        "id": "2084255968"
                    },
                    {
                        "cid": "8739",
                        "cname": "三国志大战",
                        "id": "2084060487"
                    },
                    {
                        "cid": "8740",
                        "cname": "神罗万象",
                        "id": "2084309075"
                    },
                    {
                        "cid": "8741",
                        "cname": "战国大战",
                        "id": "2084305403"
                    },
                    {
                        "cid": "8742",
                        "cname": "WCCF",
                        "id": "2084050457"
                    },
                    {
                        "cid": "8743",
                        "cname": "数码宝贝",
                        "id": "2084033665"
                    },
                    {
                        "cid": "8744",
                        "cname": "Duel Masters（决斗大师）",
                        "id": "2084049869"
                    },
                    {
                        "cid": "8745",
                        "cname": "美食的俘虏",
                        "id": "2084305406"
                    },
                    {
                        "cid": "8746",
                        "cname": "勇者斗恶龙",
                        "id": "2084019347"
                    },
                    {
                        "cid": "8747",
                        "cname": "七龙珠",
                        "id": "2084064426"
                    },
                    {
                        "cid": "8748",
                        "cname": "超速变形Gyro Zetter",
                        "id": "2084310652"
                    },
                    {
                        "cid": "8749",
                        "cname": "火影忍者",
                        "id": "2084064427"
                    },
                    {
                        "cid": "8750",
                        "cname": "Battle Spirits",
                        "id": "2084239872"
                    },
                    {
                        "cid": "8751",
                        "cname": "Panini Football League",
                        "id": "2084314542"
                    },
                    {
                        "cid": "8752",
                        "cname": "太空战士TCG",
                        "id": "2084309076"
                    },
                    {
                        "cid": "8753",
                        "cname": "足球群星",
                        "id": "2084305401"
                    },
                    {
                        "cid": "8754",
                        "cname": "光之美少女",
                        "id": "2084259102"
                    },
                    {
                        "cid": "8755",
                        "cname": "PrismStone",
                        "id": "2084305404"
                    },
                    {
                        "cid": "8756",
                        "cname": "Precious Memories",
                        "id": "2084305400"
                    },
                    {
                        "cid": "8757",
                        "cname": "职业棒球联盟",
                        "id": "2084258749"
                    },
                    {
                        "cid": "8758",
                        "cname": "棒球英雄",
                        "id": "2084199078"
                    },
                    {
                        "cid": "8759",
                        "cname": "神奇宝贝卡片游戏",
                        "id": "2084241343"
                    },
                    {
                        "cid": "8760",
                        "cname": "POKemon TRETTA",
                        "id": "2084309055"
                    },
                    {
                        "cid": "8761",
                        "cname": "口袋妖怪POKémon Battrio",
                        "id": "2084241344"
                    },
                    {
                        "cid": "8762",
                        "cname": "Weiβ Schwarz",
                        "id": "2084239871"
                    },
                    {
                        "cid": "8763",
                        "cname": "百兽大战",
                        "id": "2084236675"
                    },
                    {
                        "cid": "8764",
                        "cname": "Magic: The Gathering",
                        "id": "25828"
                    },
                    {
                        "cid": "8765",
                        "cname": "游戏王（科乐美）",
                        "id": "2084005059"
                    },
                    {
                        "cid": "8766",
                        "cname": "游戏王（BANDAI）",
                        "id": "2084019440"
                    },
                    {
                        "cid": "8767",
                        "cname": "妖怪手表",
                        "id": "2084314558"
                    },
                    {
                        "cid": "8768",
                        "cname": "收藏卡",
                        "id": "20992"
                    },
                    {
                        "cid": "8769",
                        "cname": "Lycee",
                        "id": "2084215569"
                    },
                    {
                        "cid": "8770",
                        "cname": "Rangers Strike",
                        "id": "2084236678"
                    },
                    {
                        "cid": "8771",
                        "cname": "LORD of VERMILION",
                        "id": "2084236676"
                    },
                    {
                        "cid": "8772",
                        "cname": "ONE PIECE/海贼王",
                        "id": "2084236680"
                    },
                    {
                        "cid": "8773",
                        "cname": "其他",
                        "id": "25832"
                    }
                ]
            },
            {
                "cid": "7262",
                "cname": "模型",
                "id": "25888",
                "children": [
                    {
                        "cid": "7298",
                        "cname": "漫画/动画",
                        "id": "2084023782"
                    },
                    {
                        "cid": "7299",
                        "cname": "特摄",
                        "id": "2084023622"
                    },
                    {
                        "cid": "7300",
                        "cname": "游戏人物",
                        "id": "2084040564"
                    },
                    {
                        "cid": "7301",
                        "cname": "科幻、幻想、恐怖",
                        "id": "2084023799"
                    },
                    {
                        "cid": "7302",
                        "cname": "美漫",
                        "id": "21688"
                    },
                    {
                        "cid": "7303",
                        "cname": "体育运动",
                        "id": "25892"
                    },
                    {
                        "cid": "7304",
                        "cname": "军事",
                        "id": "25890"
                    },
                    {
                        "cid": "7305",
                        "cname": "生物",
                        "id": "2084063729"
                    },
                    {
                        "cid": "7306",
                        "cname": "艺人/演员",
                        "id": "2084023795"
                    },
                    {
                        "cid": "7307",
                        "cname": "古装剧",
                        "id": "2084042426"
                    },
                    {
                        "cid": "7308",
                        "cname": "创作/原创",
                        "id": "2084023831"
                    },
                    {
                        "cid": "7309",
                        "cname": "角色娃娃",
                        "id": "25870"
                    },
                    {
                        "cid": "7310",
                        "cname": "其他",
                        "id": "2084309436"
                    }
                ]
            },
            {
                "cid": "7263",
                "cname": "塑料模型",
                "id": "2084250263",
                "children": [
                    {
                        "cid": "7661",
                        "cname": "角色",
                        "id": "2084250334"
                    },
                    {
                        "cid": "7662",
                        "cname": "汽车",
                        "id": "2084250264"
                    },
                    {
                        "cid": "7663",
                        "cname": "航空器",
                        "id": "2084250307"
                    },
                    {
                        "cid": "7664",
                        "cname": "摩托车",
                        "id": "2084250299"
                    },
                    {
                        "cid": "7665",
                        "cname": "坦克/军用车辆",
                        "id": "2084250325"
                    },
                    {
                        "cid": "7666",
                        "cname": "船/小船",
                        "id": "2084250317"
                    },
                    {
                        "cid": "7667",
                        "cname": "铁路",
                        "id": "2084250333"
                    },
                    {
                        "cid": "7668",
                        "cname": "建筑物",
                        "id": "2084250967"
                    },
                    {
                        "cid": "7669",
                        "cname": "生物",
                        "id": "2084258738"
                    },
                    {
                        "cid": "7670",
                        "cname": "迷你四驱",
                        "id": "2084250966"
                    },
                    {
                        "cid": "7671",
                        "cname": "模型制造作用品",
                        "id": "2084063789"
                    },
                    {
                        "cid": "7672",
                        "cname": "其他",
                        "id": "2084250968"
                    }
                ]
            },
            {
                "cid": "7264",
                "cname": "玩具遥控",
                "id": "2084251269",
                "children": [
                    {
                        "cid": "7777",
                        "cname": "轿车",
                        "id": "2084251274"
                    },
                    {
                        "cid": "7778",
                        "cname": "赛车",
                        "id": "2084251273"
                    },
                    {
                        "cid": "7779",
                        "cname": "卡车/拖车",
                        "id": "2084251272"
                    },
                    {
                        "cid": "7780",
                        "cname": "飞机",
                        "id": "2084251271"
                    },
                    {
                        "cid": "7781",
                        "cname": "直升飞机",
                        "id": "2084251270"
                    },
                    {
                        "cid": "7782",
                        "cname": "坦克/军用车辆",
                        "id": "2084251276"
                    },
                    {
                        "cid": "7783",
                        "cname": "船/小船",
                        "id": "2084251275"
                    },
                    {
                        "cid": "7784",
                        "cname": "其他",
                        "id": "2084251277"
                    }
                ]
            },
            {
                "cid": "7265",
                "cname": "爱好遥控",
                "id": "2084251212",
                "children": [
                    {
                        "cid": "7785",
                        "cname": "汽车",
                        "id": "2084251213"
                    },
                    {
                        "cid": "7786",
                        "cname": "飞机",
                        "id": "2084251245"
                    },
                    {
                        "cid": "7787",
                        "cname": "直升飞机",
                        "id": "2084251252"
                    },
                    {
                        "cid": "7788",
                        "cname": "坦克/军用车辆",
                        "id": "2084251260"
                    },
                    {
                        "cid": "7789",
                        "cname": "船/小船",
                        "id": "2084251259"
                    },
                    {
                        "cid": "7790",
                        "cname": "电池/充电器",
                        "id": "2084251261"
                    },
                    {
                        "cid": "7791",
                        "cname": "手柄",
                        "id": "2084251262"
                    },
                    {
                        "cid": "7792",
                        "cname": "模型制造作用品",
                        "id": "2084063789"
                    },
                    {
                        "cid": "7793",
                        "cname": "其他",
                        "id": "2084251268"
                    }
                ]
            },
            {
                "cid": "7266",
                "cname": "车模",
                "id": "2084260113",
                "children": [
                    {
                        "cid": "7842",
                        "cname": "汽车",
                        "id": "2084260114"
                    },
                    {
                        "cid": "7843",
                        "cname": "摩托车",
                        "id": "2084260189"
                    },
                    {
                        "cid": "7844",
                        "cname": "建设车辆/作业车",
                        "id": "2084260185"
                    },
                    {
                        "cid": "7845",
                        "cname": "航空器",
                        "id": "2084260186"
                    },
                    {
                        "cid": "7846",
                        "cname": "坦克/军用车辆",
                        "id": "2084260191"
                    },
                    {
                        "cid": "7847",
                        "cname": "船/小船",
                        "id": "2084260190"
                    }
                ]
            },
            {
                "cid": "7267",
                "cname": "遥控轨道赛车",
                "id": "2084259630",
                "children": [
                    {
                        "cid": "7927",
                        "cname": "车身",
                        "id": "2084259631"
                    },
                    {
                        "cid": "7928",
                        "cname": "零件",
                        "id": "2084259633"
                    },
                    {
                        "cid": "7929",
                        "cname": "路线",
                        "id": "2084259632"
                    },
                    {
                        "cid": "7930",
                        "cname": "其他",
                        "id": "2084259634"
                    }
                ]
            },
            {
                "cid": "7268",
                "cname": "铁路模型",
                "id": "2084259579",
                "children": [
                    {
                        "cid": "7931",
                        "cname": "HO量规",
                        "id": "2084259580"
                    },
                    {
                        "cid": "7932",
                        "cname": "N量规",
                        "id": "2084259591"
                    },
                    {
                        "cid": "7933",
                        "cname": "Z量规",
                        "id": "2084259619"
                    },
                    {
                        "cid": "7934",
                        "cname": "G量规",
                        "id": "2084259752"
                    },
                    {
                        "cid": "7935",
                        "cname": "O量规",
                        "id": "2084259751"
                    },
                    {
                        "cid": "7936",
                        "cname": "B TRAIN SHORTY",
                        "id": "2084259620"
                    },
                    {
                        "cid": "7937",
                        "cname": "其他",
                        "id": "2084259621"
                    }
                ]
            },
            {
                "cid": "7269",
                "cname": "火车模型",
                "id": "2084259623",
                "children": [
                    {
                        "cid": "7975",
                        "cname": "车辆单品",
                        "id": "2084259624"
                    },
                    {
                        "cid": "7976",
                        "cname": "轨道零件",
                        "id": "2084259625"
                    },
                    {
                        "cid": "7977",
                        "cname": "套装",
                        "id": "2084259626"
                    },
                    {
                        "cid": "7978",
                        "cname": "情景部件",
                        "id": "2084259627"
                    },
                    {
                        "cid": "7979",
                        "cname": "铁道扭蛋玩具",
                        "id": "2084259628"
                    },
                    {
                        "cid": "7980",
                        "cname": "其他",
                        "id": "2084259629"
                    }
                ]
            },
            {
                "cid": "7271",
                "cname": "老式的",
                "id": "27673",
                "children": [
                    {
                        "cid": "7981",
                        "cname": "铁皮",
                        "id": "27675"
                    },
                    {
                        "cid": "7982",
                        "cname": "软塑料玩具",
                        "id": "2084310547"
                    },
                    {
                        "cid": "7983",
                        "cname": "超合金",
                        "id": "2084310548"
                    },
                    {
                        "cid": "7984",
                        "cname": "交通工具",
                        "id": "27683"
                    },
                    {
                        "cid": "7985",
                        "cname": "电动",
                        "id": "27695"
                    },
                    {
                        "cid": "7986",
                        "cname": "其他",
                        "id": "27717"
                    }
                ]
            },
            {
                "cid": "7272",
                "cname": "英雄/格斗游戏",
                "id": "2084044370",
                "children": [
                    {
                        "cid": "7996",
                        "cname": "战队系列",
                        "id": "2084060551"
                    },
                    {
                        "cid": "7997",
                        "cname": "假面骑士",
                        "id": "2084060550"
                    },
                    {
                        "cid": "7998",
                        "cname": "奥特曼",
                        "id": "2084060552"
                    },
                    {
                        "cid": "7999",
                        "cname": "特摄",
                        "id": "2084023622"
                    },
                    {
                        "cid": "8000",
                        "cname": "其他",
                        "id": "2084060553"
                    }
                ]
            },
            {
                "cid": "7273",
                "cname": "女主角/时尚休闲",
                "id": "2084044371",
                "children": [
                    {
                        "cid": "8001",
                        "cname": "光之美少女",
                        "id": "2084245339"
                    },
                    {
                        "cid": "8002",
                        "cname": "美少女战士",
                        "id": "2084245340"
                    },
                    {
                        "cid": "8003",
                        "cname": "其他",
                        "id": "2084245341"
                    }
                ]
            },
            {
                "cid": "7274",
                "cname": "人偶/角色人物",
                "id": "25864",
                "children": [
                    {
                        "cid": "8004",
                        "cname": "SD娃娃",
                        "id": "2084052783"
                    },
                    {
                        "cid": "8005",
                        "cname": "Dollfie Dream",
                        "id": "2084241345"
                    },
                    {
                        "cid": "8006",
                        "cname": "custom doll",
                        "id": "2084052782"
                    },
                    {
                        "cid": "8007",
                        "cname": "角色娃娃",
                        "id": "25870"
                    },
                    {
                        "cid": "8008",
                        "cname": "换装娃娃",
                        "id": "2084020000"
                    },
                    {
                        "cid": "8009",
                        "cname": "日本玩偶",
                        "id": "2084020063"
                    },
                    {
                        "cid": "8010",
                        "cname": "陶瓷娃娃",
                        "id": "2084023608"
                    },
                    {
                        "cid": "8011",
                        "cname": "人偶房子",
                        "id": "25902"
                    },
                    {
                        "cid": "8012",
                        "cname": "洋娃娃/婴儿娃娃",
                        "id": "2084020014"
                    },
                    {
                        "cid": "8013",
                        "cname": "手工人偶",
                        "id": "25868"
                    },
                    {
                        "cid": "8014",
                        "cname": "布娃娃",
                        "id": "40494"
                    },
                    {
                        "cid": "8015",
                        "cname": "模型",
                        "id": "25888"
                    },
                    {
                        "cid": "8016",
                        "cname": "其他",
                        "id": "2084020321"
                    }
                ]
            },
            {
                "cid": "7275",
                "cname": "布娃娃",
                "id": "40494",
                "children": [
                    {
                        "cid": "8146",
                        "cname": "角色",
                        "id": "2084020100"
                    },
                    {
                        "cid": "8147",
                        "cname": "动物",
                        "id": "40509"
                    },
                    {
                        "cid": "8148",
                        "cname": "泰迪熊",
                        "id": "25812"
                    },
                    {
                        "cid": "8149",
                        "cname": "编织玩偶",
                        "id": "2084039599"
                    },
                    {
                        "cid": "8150",
                        "cname": "羊毛毡",
                        "id": "2084310501"
                    },
                    {
                        "cid": "8151",
                        "cname": "Ty Beanie",
                        "id": "2084310651"
                    }
                ]
            },
            {
                "cid": "7276",
                "cname": "过家家儿",
                "id": "2084024235",
                "children": [
                    {
                        "cid": "8305",
                        "cname": "厨房用品",
                        "id": "2084060603"
                    },
                    {
                        "cid": "8306",
                        "cname": "食物",
                        "id": "2084060602"
                    },
                    {
                        "cid": "8307",
                        "cname": "过家家套装",
                        "id": "2084060604"
                    }
                ]
            },
            {
                "cid": "7277",
                "cname": "角色玩具",
                "id": "26077",
                "children": [
                    {
                        "cid": "8308",
                        "cname": "漫画/动画周边",
                        "id": "20060"
                    },
                    {
                        "cid": "8309",
                        "cname": "PostPet",
                        "id": "2084005076"
                    },
                    {
                        "cid": "8310",
                        "cname": "托马斯小火车",
                        "id": "2084051754"
                    },
                    {
                        "cid": "8311",
                        "cname": "趴趴熊",
                        "id": "2084005074"
                    },
                    {
                        "cid": "8312",
                        "cname": "奥特曼",
                        "id": "2084005079"
                    },
                    {
                        "cid": "8313",
                        "cname": "丘比",
                        "id": "2084045620"
                    },
                    {
                        "cid": "8314",
                        "cname": "玉桂狗",
                        "id": "2084063685"
                    },
                    {
                        "cid": "8315",
                        "cname": "史努比、花生",
                        "id": "25962"
                    },
                    {
                        "cid": "8316",
                        "cname": "芝麻街",
                        "id": "40070"
                    },
                    {
                        "cid": "8317",
                        "cname": "迪斯尼",
                        "id": "27858"
                    },
                    {
                        "cid": "8318",
                        "cname": "恶梦·之前·圣诞节",
                        "id": "2084005077"
                    },
                    {
                        "cid": "8319",
                        "cname": "Hello Kitty（凯蒂猫）",
                        "id": "2084051747"
                    },
                    {
                        "cid": "8320",
                        "cname": "牛奶妹",
                        "id": "2084005075"
                    },
                    {
                        "cid": "8321",
                        "cname": "米菲兔",
                        "id": "2084063676"
                    },
                    {
                        "cid": "8322",
                        "cname": "轻松熊",
                        "id": "2084061268"
                    },
                    {
                        "cid": "8323",
                        "cname": "假面骑士",
                        "id": "2084005078"
                    }
                ]
            },
            {
                "cid": "7278",
                "cname": "食玩/赠品",
                "id": "2084312318",
                "children": [
                    {
                        "cid": "8370",
                        "cname": "格力高",
                        "id": "2084312322"
                    },
                    {
                        "cid": "8371",
                        "cname": "巧克力蛋",
                        "id": "2084312323"
                    },
                    {
                        "cid": "8372",
                        "cname": "世界坦克博物馆",
                        "id": "2084312325"
                    },
                    {
                        "cid": "8373",
                        "cname": "圣魔大战",
                        "id": "2084005054"
                    },
                    {
                        "cid": "8374",
                        "cname": "快餐玩具",
                        "id": "25872"
                    },
                    {
                        "cid": "8375",
                        "cname": "模型",
                        "id": "25888"
                    },
                    {
                        "cid": "8376",
                        "cname": "车模",
                        "id": "2084260113"
                    },
                    {
                        "cid": "8377",
                        "cname": "其他",
                        "id": "2084312319"
                    }
                ]
            },
            {
                "cid": "7279",
                "cname": "拼图",
                "id": "26018",
                "children": [
                    {
                        "cid": "8383",
                        "cname": "拼图",
                        "id": "26024"
                    },
                    {
                        "cid": "8384",
                        "cname": "魔方",
                        "id": "26026"
                    },
                    {
                        "cid": "8385",
                        "cname": "连环",
                        "id": "2084019425"
                    },
                    {
                        "cid": "8386",
                        "cname": "立体拼图",
                        "id": "2084019424"
                    },
                    {
                        "cid": "8387",
                        "cname": "其他",
                        "id": "27711"
                    }
                ]
            },
            {
                "cid": "7280",
                "cname": "游戏",
                "id": "27727",
                "children": [
                    {
                        "cid": "8388",
                        "cname": "电视游戏",
                        "id": "22844"
                    },
                    {
                        "cid": "8389",
                        "cname": "街机游戏",
                        "id": "2084047781"
                    },
                    {
                        "cid": "8390",
                        "cname": "卡片游戏",
                        "id": "25826"
                    },
                    {
                        "cid": "8391",
                        "cname": "卡片游戏",
                        "id": "2084041921"
                    },
                    {
                        "cid": "8392",
                        "cname": "TRPG",
                        "id": "2084045587"
                    },
                    {
                        "cid": "8393",
                        "cname": "桌游",
                        "id": "25824"
                    },
                    {
                        "cid": "8394",
                        "cname": "飞镖",
                        "id": "25856"
                    },
                    {
                        "cid": "8395",
                        "cname": "台球",
                        "id": "25204"
                    },
                    {
                        "cid": "8396",
                        "cname": "并戈",
                        "id": "2084036422"
                    },
                    {
                        "cid": "8397",
                        "cname": "麻将",
                        "id": "2084036423"
                    },
                    {
                        "cid": "8398",
                        "cname": "POM Jong/donjara",
                        "id": "2084036424"
                    },
                    {
                        "cid": "8399",
                        "cname": "奖牌游戏",
                        "id": "25854"
                    },
                    {
                        "cid": "8400",
                        "cname": "游戏",
                        "id": "2084307787"
                    }
                ]
            },
            {
                "cid": "7281",
                "cname": "魔术/聚会商品",
                "id": "24382",
                "children": [
                    {
                        "cid": "8923",
                        "cname": "魔术",
                        "id": "2084059851"
                    },
                    {
                        "cid": "8924",
                        "cname": "聚会商品",
                        "id": "2084059852"
                    }
                ]
            },
            {
                "cid": "7282",
                "cname": "积木/乐高",
                "id": "40510",
                "children": [
                    {
                        "cid": "8937",
                        "cname": "LEGO",
                        "id": "40516"
                    },
                    {
                        "cid": "8938",
                        "cname": "KUBRICK/BE@RBRICK",
                        "id": "2084048015"
                    },
                    {
                        "cid": "8939",
                        "cname": "块",
                        "id": "40514"
                    },
                    {
                        "cid": "8940",
                        "cname": "摩比世界",
                        "id": "2084005502"
                    },
                    {
                        "cid": "8941",
                        "cname": "积木",
                        "id": "2084023884"
                    },
                    {
                        "cid": "8942",
                        "cname": "其他",
                        "id": "40515"
                    }
                ]
            },
            {
                "cid": "7283",
                "cname": "陀螺",
                "id": "2084041892",
                "children": [
                    {
                        "cid": "8961",
                        "cname": "普通",
                        "id": "2084041893"
                    },
                    {
                        "cid": "8962",
                        "cname": "贝刀片",
                        "id": "2084041894"
                    }
                ]
            },
            {
                "cid": "7284",
                "cname": "婴儿",
                "id": "2084007247",
                "children": [
                    {
                        "cid": "8968",
                        "cname": "浴室玩具",
                        "id": "2084024150"
                    },
                    {
                        "cid": "8969",
                        "cname": "拨浪鼓",
                        "id": "2084024147"
                    },
                    {
                        "cid": "8970",
                        "cname": "快乐音乐盒",
                        "id": "2084024161"
                    },
                    {
                        "cid": "8971",
                        "cname": "婴儿玩具",
                        "id": "2084024163"
                    },
                    {
                        "cid": "8972",
                        "cname": "手推车/木制手推车",
                        "id": "2084024162"
                    },
                    {
                        "cid": "8973",
                        "cname": "乘骑玩具",
                        "id": "2084047980"
                    },
                    {
                        "cid": "8974",
                        "cname": "智育玩具",
                        "id": "2084024146"
                    },
                    {
                        "cid": "8975",
                        "cname": "其他",
                        "id": "2084047374"
                    }
                ]
            },
            {
                "cid": "7285",
                "cname": "乐器玩具",
                "id": "2084024191",
                "children": [
                    {
                        "cid": "8976",
                        "cname": "太鼓",
                        "id": "2084024193"
                    },
                    {
                        "cid": "8977",
                        "cname": "钢琴",
                        "id": "2084024192"
                    },
                    {
                        "cid": "8978",
                        "cname": "笛子/喇叭",
                        "id": "2084024194"
                    },
                    {
                        "cid": "8979",
                        "cname": "乐器/器材",
                        "id": "22436"
                    },
                    {
                        "cid": "8980",
                        "cname": "其他",
                        "id": "2084024195"
                    }
                ]
            },
            {
                "cid": "7286",
                "cname": "乘骑玩具",
                "id": "2084024190",
                "children": [
                    {
                        "cid": "8981",
                        "cname": "三轮车",
                        "id": "2084045643"
                    },
                    {
                        "cid": "8982",
                        "cname": "滑板车",
                        "id": "2084024196"
                    },
                    {
                        "cid": "8983",
                        "cname": "乘骑玩具",
                        "id": "2084047980"
                    },
                    {
                        "cid": "8984",
                        "cname": "独轮车",
                        "id": "2084045644"
                    },
                    {
                        "cid": "8985",
                        "cname": "自行车/自行车运动",
                        "id": "26222"
                    },
                    {
                        "cid": "8986",
                        "cname": "其他",
                        "id": "2084045642"
                    }
                ]
            },
            {
                "cid": "7287",
                "cname": "智育玩具",
                "id": "2084024146",
                "children": [
                    {
                        "cid": "8987",
                        "cname": "文字/词汇",
                        "id": "2084045577"
                    },
                    {
                        "cid": "8988",
                        "cname": "数字/计算",
                        "id": "2084045578"
                    },
                    {
                        "cid": "8989",
                        "cname": "节奏、音乐",
                        "id": "2084045579"
                    },
                    {
                        "cid": "8990",
                        "cname": "英语",
                        "id": "2084045580"
                    },
                    {
                        "cid": "8991",
                        "cname": "纸牌",
                        "id": "2084044884"
                    },
                    {
                        "cid": "8992",
                        "cname": "拼图",
                        "id": "26018"
                    },
                    {
                        "cid": "8993",
                        "cname": "块/积木",
                        "id": "40510"
                    },
                    {
                        "cid": "8994",
                        "cname": "学龄",
                        "id": "2084008619"
                    },
                    {
                        "cid": "8995",
                        "cname": "智育图画书/学习图画书",
                        "id": "2084008647"
                    },
                    {
                        "cid": "8996",
                        "cname": "其他",
                        "id": "2084045581"
                    }
                ]
            },
            {
                "cid": "7288",
                "cname": "电子玩具",
                "id": "2084024164",
                "children": [
                    {
                        "cid": "8997",
                        "cname": "玩具计算机",
                        "id": "2084024182"
                    },
                    {
                        "cid": "8998",
                        "cname": "电视游戏",
                        "id": "22844"
                    },
                    {
                        "cid": "8999",
                        "cname": "虚拟宠物",
                        "id": "2084024165"
                    },
                    {
                        "cid": "9000",
                        "cname": "学研电子块",
                        "id": "2084046960"
                    },
                    {
                        "cid": "9001",
                        "cname": "儿童电子手册",
                        "id": "2084024186"
                    },
                    {
                        "cid": "9002",
                        "cname": "其他",
                        "id": "2084024188"
                    }
                ]
            },
            {
                "cid": "7289",
                "cname": "游乐设施",
                "id": "2084041664",
                "children": [
                    {
                        "cid": "9016",
                        "cname": "滑梯",
                        "id": "2084041666"
                    },
                    {
                        "cid": "9017",
                        "cname": "攀登架",
                        "id": "2084041665"
                    },
                    {
                        "cid": "9018",
                        "cname": "秋千",
                        "id": "2084041667"
                    },
                    {
                        "cid": "9019",
                        "cname": "其他",
                        "id": "2084041668"
                    }
                ]
            },
            {
                "cid": "7290",
                "cname": "发条类玩具",
                "id": "26080",
                "children": []
            },
            {
                "cid": "7291",
                "cname": "SF",
                "id": "26038",
                "children": [
                    {
                        "cid": "9020",
                        "cname": "星球大战系列",
                        "id": "26042"
                    },
                    {
                        "cid": "9021",
                        "cname": "其他",
                        "id": "26046"
                    }
                ]
            },
            {
                "cid": "7292",
                "cname": "快餐玩具",
                "id": "25872",
                "children": [
                    {
                        "cid": "9091",
                        "cname": "麦当劳",
                        "id": "25874"
                    },
                    {
                        "cid": "9092",
                        "cname": "肯德基・油炸・鸡肉",
                        "id": "27818"
                    },
                    {
                        "cid": "9093",
                        "cname": "汉堡王",
                        "id": "25878"
                    },
                    {
                        "cid": "9094",
                        "cname": "美仕唐纳滋",
                        "id": "2084005201"
                    },
                    {
                        "cid": "9095",
                        "cname": "其他",
                        "id": "25886"
                    }
                ]
            },
            {
                "cid": "7293",
                "cname": "玩水",
                "id": "2084042420",
                "children": [
                    {
                        "cid": "9141",
                        "cname": "救生圈/浮具",
                        "id": "2084042423"
                    },
                    {
                        "cid": "9142",
                        "cname": "充气艇",
                        "id": "2084044885"
                    },
                    {
                        "cid": "9143",
                        "cname": "遮阳伞",
                        "id": "2084208878"
                    },
                    {
                        "cid": "9144",
                        "cname": "海滩球",
                        "id": "2084042424"
                    },
                    {
                        "cid": "9145",
                        "cname": "业余活动ー",
                        "id": "2084042422"
                    },
                    {
                        "cid": "9146",
                        "cname": "家用泳池",
                        "id": "2084042421"
                    },
                    {
                        "cid": "9147",
                        "cname": "水枪",
                        "id": "2084042425"
                    },
                    {
                        "cid": "9148",
                        "cname": "游泳池",
                        "id": "2084042176"
                    }
                ]
            },
            {
                "cid": "7294",
                "cname": "烟花",
                "id": "2084315353",
                "children": []
            },
            {
                "cid": "7295",
                "cname": "玩具",
                "id": "2084307786",
                "children": []
            },
            {
                "cid": "7296",
                "cname": "游戏",
                "id": "2084307787",
                "children": []
            },
            {
                "cid": "7297",
                "cname": "其他",
                "id": "26082",
                "children": []
            }
        ]
    },
    {
        "cid": "7",
        "cname": "文化/艺术",
        "id": "24242",
        "children": [
            {
                "cid": "9149",
                "cname": "乐器/器材",
                "id": "22436",
                "children": [
                    {
                        "cid": "9168",
                        "cname": "吉他",
                        "id": "22476"
                    },
                    {
                        "cid": "9169",
                        "cname": "基地",
                        "id": "22480"
                    },
                    {
                        "cid": "9170",
                        "cname": "弦乐器",
                        "id": "22572"
                    },
                    {
                        "cid": "9171",
                        "cname": "管乐器",
                        "id": "22440"
                    },
                    {
                        "cid": "9172",
                        "cname": "键盘乐器",
                        "id": "22532"
                    },
                    {
                        "cid": "9173",
                        "cname": "打击乐器",
                        "id": "22500"
                    },
                    {
                        "cid": "9174",
                        "cname": "传统日本乐器",
                        "id": "2084305860"
                    },
                    {
                        "cid": "9175",
                        "cname": "乐高竞赛",
                        "id": "2084019010"
                    },
                    {
                        "cid": "9176",
                        "cname": "DJ设备",
                        "id": "2084261081"
                    },
                    {
                        "cid": "9177",
                        "cname": "DTM/DAW",
                        "id": "22544"
                    },
                    {
                        "cid": "9178",
                        "cname": "放大器",
                        "id": "2084005286"
                    },
                    {
                        "cid": "9179",
                        "cname": "节拍器",
                        "id": "2084210466"
                    },
                    {
                        "cid": "9180",
                        "cname": "谱架",
                        "id": "2084210467"
                    },
                    {
                        "cid": "9181",
                        "cname": "隔音产品",
                        "id": "2084285349"
                    },
                    {
                        "cid": "9182",
                        "cname": "乐器玩具",
                        "id": "2084024191"
                    },
                    {
                        "cid": "9183",
                        "cname": "乐谱",
                        "id": "2084009086"
                    },
                    {
                        "cid": "9184",
                        "cname": "录音/音乐制作",
                        "id": "2084307734"
                    },
                    {
                        "cid": "9185",
                        "cname": "乐器修理/改造",
                        "id": "2084307822"
                    },
                    {
                        "cid": "9186",
                        "cname": "仪器的经验教训",
                        "id": "2084307743"
                    },
                    {
                        "cid": "9187",
                        "cname": "乐器租赁",
                        "id": "2084307790"
                    },
                    {
                        "cid": "9188",
                        "cname": "其他",
                        "id": "22656"
                    }
                ]
            },
            {
                "cid": "9150",
                "cname": "美术品",
                "id": "20056",
                "children": [
                    {
                        "cid": "9705",
                        "cname": "绘画",
                        "id": "20080"
                    },
                    {
                        "cid": "9706",
                        "cname": "版画",
                        "id": "2084006148"
                    },
                    {
                        "cid": "9707",
                        "cname": "雕刻",
                        "id": "20120"
                    },
                    {
                        "cid": "9708",
                        "cname": "工艺品",
                        "id": "2084024008"
                    },
                    {
                        "cid": "9709",
                        "cname": "画框",
                        "id": "2084006189"
                    },
                    {
                        "cid": "9710",
                        "cname": "书法作品",
                        "id": "2084006117"
                    },
                    {
                        "cid": "9711",
                        "cname": "艺术照片",
                        "id": "20084"
                    },
                    {
                        "cid": "9712",
                        "cname": "书",
                        "id": "2084060415"
                    },
                    {
                        "cid": "9713",
                        "cname": "绘画/工艺品",
                        "id": "2084307788"
                    },
                    {
                        "cid": "9714",
                        "cname": "杂志",
                        "id": "2084060423"
                    },
                    {
                        "cid": "9715",
                        "cname": "（美术品）其他",
                        "id": "20128"
                    }
                ]
            },
            {
                "cid": "9151",
                "cname": "美术用品",
                "id": "20124",
                "children": [
                    {
                        "cid": "9791",
                        "cname": "绘画的题材",
                        "id": "2084006188"
                    },
                    {
                        "cid": "9792",
                        "cname": "画框",
                        "id": "2084006189"
                    },
                    {
                        "cid": "9793",
                        "cname": "美术品",
                        "id": "20056"
                    },
                    {
                        "cid": "9794",
                        "cname": "（艺术用品）其他",
                        "id": "2084006190"
                    }
                ]
            },
            {
                "cid": "9152",
                "cname": "手工品/机器",
                "id": "20924",
                "children": [
                    {
                        "cid": "9815",
                        "cname": "裁缝、刺绣",
                        "id": "24414"
                    },
                    {
                        "cid": "9816",
                        "cname": "缝纫机",
                        "id": "2084008354"
                    },
                    {
                        "cid": "9817",
                        "cname": "玻璃珠工艺",
                        "id": "2084042445"
                    },
                    {
                        "cid": "9818",
                        "cname": "编织品",
                        "id": "2084045848"
                    },
                    {
                        "cid": "9819",
                        "cname": "黏土工艺",
                        "id": "2084042444"
                    },
                    {
                        "cid": "9820",
                        "cname": "皮革工艺",
                        "id": "2084063304"
                    },
                    {
                        "cid": "9821",
                        "cname": "纸工艺品",
                        "id": "2084063305"
                    },
                    {
                        "cid": "9822",
                        "cname": "押花艺术花",
                        "id": "2084006705"
                    },
                    {
                        "cid": "9823",
                        "cname": "木工、油漆",
                        "id": "2084042440"
                    },
                    {
                        "cid": "9824",
                        "cname": "玻璃工艺",
                        "id": "2084042442"
                    },
                    {
                        "cid": "9825",
                        "cname": "银黏土",
                        "id": "2084305345"
                    },
                    {
                        "cid": "9826",
                        "cname": "金属加工,雕金",
                        "id": "2084042443"
                    },
                    {
                        "cid": "9827",
                        "cname": "香熏蜡烛",
                        "id": "2084305332"
                    },
                    {
                        "cid": "9828",
                        "cname": "Dekopatsu",
                        "id": "2084063367"
                    },
                    {
                        "cid": "9829",
                        "cname": "人偶/角色人物",
                        "id": "25864"
                    },
                    {
                        "cid": "9830",
                        "cname": "工艺品这",
                        "id": "2084008951"
                    },
                    {
                        "cid": "9831",
                        "cname": "艺术用品",
                        "id": "20124"
                    },
                    {
                        "cid": "9832",
                        "cname": "女模特儿",
                        "id": "2084045790"
                    },
                    {
                        "cid": "9833",
                        "cname": "成品",
                        "id": "2084220297"
                    },
                    {
                        "cid": "9834",
                        "cname": "其他",
                        "id": "2084042439"
                    }
                ]
            },
        ]
    },
    {
        "cid": "8",
        "cname": "收藏艺术",
        "id": "20000",
        "children": [
            {
                "cid": "10109",
                "cname": "工艺品",
                "id": "2084024008",
                "children": [
                    {
                        "cid": "10133",
                        "cname": "陶艺",
                        "id": "20132"
                    },
                    {
                        "cid": "10134",
                        "cname": "玻璃",
                        "id": "20240"
                    },
                    {
                        "cid": "10135",
                        "cname": "漆艺",
                        "id": "2084024113"
                    },
                    {
                        "cid": "10136",
                        "cname": "金属工艺",
                        "id": "2084195327"
                    },
                    {
                        "cid": "10137",
                        "cname": "刀锷/用具",
                        "id": "2084057815"
                    },
                    {
                        "cid": "10138",
                        "cname": "木工/竹工艺",
                        "id": "2084258274"
                    },
                    {
                        "cid": "10139",
                        "cname": "摆设",
                        "id": "2084024410"
                    },
                    {
                        "cid": "10140",
                        "cname": "坠子",
                        "id": "2084057811"
                    },
                    {
                        "cid": "10141",
                        "cname": "日本玩偶",
                        "id": "2084020063"
                    },
                    {
                        "cid": "10142",
                        "cname": "工艺",
                        "id": "2084009065"
                    },
                    {
                        "cid": "10143",
                        "cname": "绘画/工艺品",
                        "id": "2084307788"
                    }
                ]
            },
            {
                "cid": "10110",
                "cname": "美术品",
                "id": "20056",
                "children": [
                    {
                        "cid": "9705",
                        "cname": "绘画",
                        "id": "20080"
                    },
                    {
                        "cid": "9706",
                        "cname": "版画",
                        "id": "2084006148"
                    },
                    {
                        "cid": "9707",
                        "cname": "雕刻",
                        "id": "20120"
                    },
                    {
                        "cid": "9708",
                        "cname": "工艺品",
                        "id": "2084024008"
                    },
                    {
                        "cid": "9709",
                        "cname": "画框",
                        "id": "2084006189"
                    },
                    {
                        "cid": "9710",
                        "cname": "书法作品",
                        "id": "2084006117"
                    },
                    {
                        "cid": "9711",
                        "cname": "艺术照片",
                        "id": "20084"
                    },
                    {
                        "cid": "9712",
                        "cname": "书",
                        "id": "2084060415"
                    },
                    {
                        "cid": "9713",
                        "cname": "绘画/工艺品",
                        "id": "2084307788"
                    },
                    {
                        "cid": "9714",
                        "cname": "杂志",
                        "id": "2084060423"
                    },
                    {
                        "cid": "9715",
                        "cname": "（美术品）其他",
                        "id": "20128"
                    }
                ]
            },
            {
                "cid": "10111",
                "cname": "家具",
                "id": "2084236067",
                "children": [
                    {
                        "cid": "10364",
                        "cname": "日本",
                        "id": "2084236074"
                    },
                    {
                        "cid": "10365",
                        "cname": "亚洲",
                        "id": "2084236075"
                    },
                    {
                        "cid": "10366",
                        "cname": "西方",
                        "id": "2084236076"
                    },
                    {
                        "cid": "10367",
                        "cname": "店铺家具",
                        "id": "2084263156"
                    }
                ]
            },
            {
                "cid": "10112",
                "cname": "门窗",
                "id": "2084261100",
                "children": []
            },
            {
                "cid": "10113",
                "cname": "武士刀/盔甲",
                "id": "2084259484",
                "children": [
                    {
                        "cid": "10373",
                        "cname": "日本刀/剑",
                        "id": "2084310194"
                    },
                    {
                        "cid": "10374",
                        "cname": "刀锷/用具",
                        "id": "2084057815"
                    },
                    {
                        "cid": "10375",
                        "cname": "火绳枪/抬枪",
                        "id": "2084311415"
                    },
                    {
                        "cid": "10376",
                        "cname": "副本/装饰枪",
                        "id": "2084311419"
                    },
                    {
                        "cid": "10377",
                        "cname": "甲胄（头盔/铠甲）",
                        "id": "2084259485"
                    },
                    {
                        "cid": "10378",
                        "cname": "马具",
                        "id": "2084259486"
                    },
                    {
                        "cid": "10379",
                        "cname": "其他",
                        "id": "2084259487"
                    }
                ]
            },
            {
                "cid": "10114",
                "cname": "邮票和明信片",
                "id": "20960",
                "children": [
                    {
                        "cid": "10384",
                        "cname": "首日封",
                        "id": "40575"
                    },
                    {
                        "cid": "10385",
                        "cname": "日本",
                        "id": "44293"
                    },
                    {
                        "cid": "10386",
                        "cname": "亚洲",
                        "id": "44279"
                    },
                    {
                        "cid": "10387",
                        "cname": "北美洲",
                        "id": "44168"
                    },
                    {
                        "cid": "10388",
                        "cname": "南美洲",
                        "id": "44170"
                    },
                    {
                        "cid": "10389",
                        "cname": "欧洲",
                        "id": "44180"
                    },
                    {
                        "cid": "10390",
                        "cname": "非洲",
                        "id": "2084005731"
                    },
                    {
                        "cid": "10391",
                        "cname": "大洋洲",
                        "id": "2084005730"
                    },
                    {
                        "cid": "10392",
                        "cname": "明信片",
                        "id": "2084046934"
                    },
                    {
                        "cid": "10393",
                        "cname": "收集邮票货币/收集",
                        "id": "21632"
                    },
                    {
                        "cid": "10394",
                        "cname": "其他",
                        "id": "20984"
                    }
                ]
            },
            {
                "cid": "10115",
                "cname": "货币",
                "id": "20452",
                "children": [
                    {
                        "cid": "10470",
                        "cname": "硬币",
                        "id": "20460"
                    },
                    {
                        "cid": "10471",
                        "cname": "纸币",
                        "id": "20640"
                    },
                    {
                        "cid": "10472",
                        "cname": "原料金属",
                        "id": "20456"
                    },
                    {
                        "cid": "10473",
                        "cname": "收集邮票货币/收集",
                        "id": "21632"
                    },
                    {
                        "cid": "10474",
                        "cname": "其他",
                        "id": "20644"
                    }
                ]
            },
            {
                "cid": "10117",
                "cname": "收藏卡",
                "id": "20992",
                "children": [
                    {
                        "cid": "10617",
                        "cname": "卡片游戏",
                        "id": "25826"
                    },
                    {
                        "cid": "10618",
                        "cname": "漫画/动画",
                        "id": "21020"
                    },
                    {
                        "cid": "10619",
                        "cname": "体育运动",
                        "id": "2084006003"
                    },
                    {
                        "cid": "10620",
                        "cname": "艺人",
                        "id": "2084006042"
                    },
                    {
                        "cid": "10621",
                        "cname": "电视游戏",
                        "id": "2084006008"
                    },
                    {
                        "cid": "10622",
                        "cname": "音乐家",
                        "id": "2084006088"
                    },
                    {
                        "cid": "10623",
                        "cname": "赛马",
                        "id": "2084007536"
                    },
                    {
                        "cid": "10624",
                        "cname": "特摄",
                        "id": "2084006025"
                    },
                    {
                        "cid": "10625",
                        "cname": "其他",
                        "id": "21056"
                    }
                ]
            },
            {
                "cid": "10118",
                "cname": "广告/广告赠品",
                "id": "27771",
                "children": [
                    {
                        "cid": "10807",
                        "cname": "T恤",
                        "id": "2084005454"
                    },
                    {
                        "cid": "10808",
                        "cname": "香烟",
                        "id": "27776"
                    },
                    {
                        "cid": "10809",
                        "cname": "角色",
                        "id": "27774"
                    },
                    {
                        "cid": "10810",
                        "cname": "饮料",
                        "id": "20652"
                    },
                    {
                        "cid": "10811",
                        "cname": "标签",
                        "id": "27782"
                    },
                    {
                        "cid": "10812",
                        "cname": "招牌",
                        "id": "27784"
                    },
                    {
                        "cid": "10813",
                        "cname": "食品包装",
                        "id": "25887"
                    },
                    {
                        "cid": "10814",
                        "cname": "其他",
                        "id": "27788"
                    }
                ]
            },
            {
                "cid": "10119",
                "cname": "宝石/标本",
                "id": "20764",
                "children": [
                    {
                        "cid": "10821",
                        "cname": "科学、自然",
                        "id": "42528"
                    },
                    {
                        "cid": "10822",
                        "cname": "化石",
                        "id": "20772"
                    },
                    {
                        "cid": "10823",
                        "cname": "岩石/矿物",
                        "id": "20768"
                    },
                    {
                        "cid": "10824",
                        "cname": "自然科学和技术",
                        "id": "21820"
                    },
                    {
                        "cid": "10825",
                        "cname": "其他",
                        "id": "27826"
                    }
                ]
            },
            {
                "cid": "10120",
                "cname": "电子产品",
                "id": "20004",
                "children": [
                    {
                        "cid": "10830",
                        "cname": "熨斗",
                        "id": "40546"
                    },
                    {
                        "cid": "10831",
                        "cname": "打字机",
                        "id": "20040"
                    },
                    {
                        "cid": "10832",
                        "cname": "电视",
                        "id": "20036"
                    },
                    {
                        "cid": "10833",
                        "cname": "面包机",
                        "id": "20032"
                    },
                    {
                        "cid": "10834",
                        "cname": "搅拌机",
                        "id": "20016"
                    },
                    {
                        "cid": "10835",
                        "cname": "缝纫机",
                        "id": "20024"
                    },
                    {
                        "cid": "10836",
                        "cname": "古董",
                        "id": "20020"
                    },
                    {
                        "cid": "10837",
                        "cname": "照明",
                        "id": "20012"
                    },
                    {
                        "cid": "10838",
                        "cname": "电风扇",
                        "id": "20008"
                    },
                    {
                        "cid": "10839",
                        "cname": "洗衣机",
                        "id": "20048"
                    },
                    {
                        "cid": "10840",
                        "cname": "吸尘器",
                        "id": "20044"
                    },
                    {
                        "cid": "10841",
                        "cname": "电话机",
                        "id": "20028"
                    },
                    {
                        "cid": "10842",
                        "cname": "冰箱",
                        "id": "2084236050"
                    },
                    {
                        "cid": "10843",
                        "cname": "其他",
                        "id": "2084236033"
                    }
                ]
            },
            {
                "cid": "10121",
                "cname": "留声机/唱片",
                "id": "2084048439",
                "children": [
                    {
                        "cid": "10844",
                        "cname": "本体",
                        "id": "2084224175"
                    },
                    {
                        "cid": "10845",
                        "cname": "SP盘",
                        "id": "2084224176"
                    },
                    {
                        "cid": "10846",
                        "cname": "其他",
                        "id": "2084224177"
                    }
                ]
            },
            {
                "cid": "10122",
                "cname": "交通工具",
                "id": "21060",
                "children": [
                    {
                        "cid": "10850",
                        "cname": "摩托车",
                        "id": "26314"
                    },
                    {
                        "cid": "10851",
                        "cname": "自行车",
                        "id": "26306"
                    },
                    {
                        "cid": "10852",
                        "cname": "汽车",
                        "id": "26324"
                    },
                    {
                        "cid": "10853",
                        "cname": "船",
                        "id": "21104"
                    },
                    {
                        "cid": "10854",
                        "cname": "其他",
                        "id": "21112"
                    }
                ]
            },
            {
                "cid": "10123",
                "cname": "迪斯尼",
                "id": "27858",
                "children": [
                    {
                        "cid": "10858",
                        "cname": "迪斯尼",
                        "id": "2084020108"
                    },
                    {
                        "cid": "10859",
                        "cname": "迪斯尼",
                        "id": "27587"
                    },
                    {
                        "cid": "10860",
                        "cname": "迪斯尼",
                        "id": "22094"
                    },
                    {
                        "cid": "10861",
                        "cname": "迪斯尼",
                        "id": "44364"
                    },
                    {
                        "cid": "10862",
                        "cname": "迪斯尼",
                        "id": "2084005550"
                    },
                    {
                        "cid": "10863",
                        "cname": "其他",
                        "id": "27862"
                    }
                ]
            },
            {
                "cid": "10124",
                "cname": "科幻",
                "id": "42223",
                "children": [
                    {
                        "cid": "10864",
                        "cname": "X-档案",
                        "id": "26044"
                    },
                    {
                        "cid": "10865",
                        "cname": "星球大战",
                        "id": "42224"
                    },
                    {
                        "cid": "10866",
                        "cname": "星际旅行",
                        "id": "42225"
                    },
                    {
                        "cid": "10867",
                        "cname": "科幻、幻想、恐怖",
                        "id": "2084023799"
                    },
                    {
                        "cid": "10868",
                        "cname": "SF",
                        "id": "26038"
                    },
                    {
                        "cid": "10869",
                        "cname": "其他",
                        "id": "42229"
                    }
                ]
            },
            {
                "cid": "10125",
                "cname": "瓶盖",
                "id": "2084045612",
                "children": [
                    {
                        "cid": "10870",
                        "cname": "漫画/动画",
                        "id": "2084055388"
                    },
                    {
                        "cid": "10871",
                        "cname": "游戏人物",
                        "id": "2084055387"
                    },
                    {
                        "cid": "10872",
                        "cname": "电影",
                        "id": "2084055386"
                    },
                    {
                        "cid": "10873",
                        "cname": "特摄/英雄",
                        "id": "2084055390"
                    },
                    {
                        "cid": "10874",
                        "cname": "体育运动",
                        "id": "2084055389"
                    },
                    {
                        "cid": "10875",
                        "cname": "生物",
                        "id": "2084055392"
                    },
                    {
                        "cid": "10876",
                        "cname": "角色",
                        "id": "2084055391"
                    },
                    {
                        "cid": "10877",
                        "cname": "其他",
                        "id": "2084055393"
                    }
                ]
            },
            {
                "cid": "10126",
                "cname": "签名",
                "id": "27856",
                "children": [
                    {
                        "cid": "10878",
                        "cname": "签名、亲笔画",
                        "id": "2084050909"
                    },
                    {
                        "cid": "10879",
                        "cname": "签名",
                        "id": "25412"
                    },
                    {
                        "cid": "10880",
                        "cname": "签名",
                        "id": "25384"
                    },
                    {
                        "cid": "10881",
                        "cname": "签名",
                        "id": "2084005082"
                    },
                    {
                        "cid": "10882",
                        "cname": "签名",
                        "id": "22128"
                    },
                    {
                        "cid": "10883",
                        "cname": "签名",
                        "id": "2084046289"
                    },
                    {
                        "cid": "10884",
                        "cname": "签名",
                        "id": "2084047075"
                    },
                    {
                        "cid": "10885",
                        "cname": "签名",
                        "id": "25376"
                    },
                    {
                        "cid": "10886",
                        "cname": "其他",
                        "id": "2084005084"
                    }
                ]
            },
            {
                "cid": "10127",
                "cname": "打火机/烟具",
                "id": "21152",
                "children": [
                    {
                        "cid": "10887",
                        "cname": "PEZ",
                        "id": "25972"
                    },
                    {
                        "cid": "10888",
                        "cname": "八音盒",
                        "id": "2084047372"
                    },
                    {
                        "cid": "10889",
                        "cname": "钥匙扣",
                        "id": "40427"
                    },
                    {
                        "cid": "10890",
                        "cname": "贴纸",
                        "id": "26066"
                    },
                    {
                        "cid": "10891",
                        "cname": "雪花玻璃球",
                        "id": "26048"
                    },
                    {
                        "cid": "10892",
                        "cname": "电话卡",
                        "id": "23968"
                    },
                    {
                        "cid": "10893",
                        "cname": "Pyrex",
                        "id": "2084058450"
                    },
                    {
                        "cid": "10894",
                        "cname": "徽章",
                        "id": "2084312400"
                    },
                    {
                        "cid": "10895",
                        "cname": "fireking",
                        "id": "2084058449"
                    },
                    {
                        "cid": "10896",
                        "cname": "火柴盒",
                        "id": "20392"
                    },
                    {
                        "cid": "10897",
                        "cname": "家具",
                        "id": "2084236067"
                    },
                    {
                        "cid": "10898",
                        "cname": "美术明信片",
                        "id": "20988"
                    },
                    {
                        "cid": "10899",
                        "cname": "吸烟商品",
                        "id": "26126"
                    },
                    {
                        "cid": "10900",
                        "cname": "警察商品",
                        "id": "40565"
                    },
                    {
                        "cid": "10901",
                        "cname": "门窗",
                        "id": "2084261100"
                    },
                    {
                        "cid": "10902",
                        "cname": "磁铁",
                        "id": "20356"
                    },
                    {
                        "cid": "10903",
                        "cname": "储蓄箱",
                        "id": "26014"
                    },
                    {
                        "cid": "10904",
                        "cname": "店铺家具",
                        "id": "2084263156"
                    },
                    {
                        "cid": "10905",
                        "cname": "笔记用具",
                        "id": "21116"
                    },
                    {
                        "cid": "10906",
                        "cname": "便当盒",
                        "id": "25906"
                    },
                    {
                        "cid": "10907",
                        "cname": "老式的",
                        "id": "27673"
                    },
                    {
                        "cid": "10908",
                        "cname": "其他",
                        "id": "21595"
                    }
                ]
            },
            {
                "cid": "10128",
                "cname": "老式的",
                "id": "27673",
                "children": [
                    {
                        "cid": "7981",
                        "cname": "铁皮",
                        "id": "27675"
                    },
                    {
                        "cid": "7982",
                        "cname": "软塑料玩具",
                        "id": "2084310547"
                    },
                    {
                        "cid": "7983",
                        "cname": "超合金",
                        "id": "2084310548"
                    },
                    {
                        "cid": "7984",
                        "cname": "交通工具",
                        "id": "27683"
                    },
                    {
                        "cid": "7985",
                        "cname": "电动",
                        "id": "27695"
                    },
                    {
                        "cid": "7986",
                        "cname": "其他",
                        "id": "27717"
                    }
                ]
            },
            {
                "cid": "10129",
                "cname": "电话卡",
                "id": "23968",
                "children": [
                    {
                        "cid": "44973",
                        "cname": "玩具人物",
                        "id": "2084005121"
                    },
                    {
                        "cid": "44974",
                        "cname": "漫画/动漫",
                        "id": "2084005120"
                    },
                    {
                        "cid": "44975",
                        "cname": "运动类",
                        "id": "2084005113"
                    },
                    {
                        "cid": "44976",
                        "cname": "电视游戏",
                        "id": "2084005119"
                    },
                    {
                        "cid": "44977",
                        "cname": "电视节目",
                        "id": "2084005123"
                    },
                    {
                        "cid": "44978",
                        "cname": "音乐家",
                        "id": "2084005105"
                    },
                    {
                        "cid": "44979",
                        "cname": "尼龙",
                        "id": "2084005124"
                    },
                    {
                        "cid": "44980",
                        "cname": "电影",
                        "id": "2084005122"
                    },
                    {
                        "cid": "44981",
                        "cname": "绘画艺术（公共电话卡）",
                        "id": "2084048484"
                    },
                    {
                        "cid": "44982",
                        "cname": "艺人、演员",
                        "id": "2084005109"
                    },
                    {
                        "cid": "44983",
                        "cname": "飞机",
                        "id": "2084007949"
                    },
                    {
                        "cid": "44984",
                        "cname": "汽车",
                        "id": "2084007950"
                    },
                    {
                        "cid": "44985",
                        "cname": "植物",
                        "id": "2084048482"
                    },
                    {
                        "cid": "44986",
                        "cname": "配音演员 ",
                        "id": "2084005104"
                    },
                    {
                        "cid": "44987",
                        "cname": "铁路",
                        "id": "2084007801"
                    },
                    {
                        "cid": "44988",
                        "cname": "动物",
                        "id": "2084048481"
                    },
                    {
                        "cid": "44989",
                        "cname": "风景",
                        "id": "2084048483"
                    },
                    {
                        "cid": "44990",
                        "cname": "其他",
                        "id": "2084005125"
                    }
                ]
            },
            {
                "cid": "10130",
                "cname": "模型",
                "id": "25888",
                "children": [
                    {
                        "cid": "7298",
                        "cname": "漫画/动画",
                        "id": "2084023782"
                    },
                    {
                        "cid": "7299",
                        "cname": "特摄",
                        "id": "2084023622"
                    },
                    {
                        "cid": "7300",
                        "cname": "游戏人物",
                        "id": "2084040564"
                    },
                    {
                        "cid": "7301",
                        "cname": "科幻、幻想、恐怖",
                        "id": "2084023799"
                    },
                    {
                        "cid": "7302",
                        "cname": "美漫",
                        "id": "21688"
                    },
                    {
                        "cid": "7303",
                        "cname": "体育运动",
                        "id": "25892"
                    },
                    {
                        "cid": "7304",
                        "cname": "军事",
                        "id": "25890"
                    },
                    {
                        "cid": "7305",
                        "cname": "生物",
                        "id": "2084063729"
                    },
                    {
                        "cid": "7306",
                        "cname": "艺人/演员",
                        "id": "2084023795"
                    },
                    {
                        "cid": "7307",
                        "cname": "古装剧",
                        "id": "2084042426"
                    },
                    {
                        "cid": "7308",
                        "cname": "创作/原创",
                        "id": "2084023831"
                    },
                    {
                        "cid": "7309",
                        "cname": "角色娃娃",
                        "id": "25870"
                    },
                    {
                        "cid": "7310",
                        "cname": "其他",
                        "id": "2084309436"
                    }
                ]
            },
            {
                "cid": "10132",
                "cname": "美术工艺品",
                "id": "2084307788",
                "children": []
            }
        ]
    },
    {
        "cid": "9",
        "cname": "运动/休闲",
        "id": "24698",
        "children": [
            {
                "cid": "11012",
                "cname": "高尔夫",
                "id": "25152",
                "children": [
                    {
                        "cid": "11035",
                        "cname": "射箭",
                        "id": "25224"
                    },
                    {
                        "cid": "11036",
                        "cname": "溜冰",
                        "id": "25232"
                    },
                    {
                        "cid": "11037",
                        "cname": "冰球",
                        "id": "25350"
                    },
                    {
                        "cid": "11038",
                        "cname": "美式足球",
                        "id": "25346"
                    },
                    {
                        "cid": "11039",
                        "cname": "旱冰",
                        "id": "25282"
                    },
                    {
                        "cid": "11040",
                        "cname": "冲浪",
                        "id": "25248"
                    },
                    {
                        "cid": "11041",
                        "cname": "冲浪板",
                        "id": "25244"
                    },
                    {
                        "cid": "11042",
                        "cname": "步行",
                        "id": "2084196837"
                    },
                    {
                        "cid": "11043",
                        "cname": "运动用品",
                        "id": "25154"
                    },
                    {
                        "cid": "11044",
                        "cname": "赛车",
                        "id": "2084047456"
                    },
                    {
                        "cid": "11045",
                        "cname": "Golf",
                        "id": "25042"
                    },
                    {
                        "cid": "11046",
                        "cname": "格斗技/职业摔跤",
                        "id": "2084032407"
                    },
                    {
                        "cid": "11047",
                        "cname": "射箭",
                        "id": "2084228304"
                    },
                    {
                        "cid": "11048",
                        "cname": "空手道",
                        "id": "2084258252"
                    },
                    {
                        "cid": "11049",
                        "cname": "剑道",
                        "id": "2084005345"
                    },
                    {
                        "cid": "11050",
                        "cname": "冲浪",
                        "id": "25242"
                    },
                    {
                        "cid": "11051",
                        "cname": "足球",
                        "id": "25344"
                    },
                    {
                        "cid": "11052",
                        "cname": "天空体育",
                        "id": "2084048552"
                    },
                    {
                        "cid": "11053",
                        "cname": "壁球",
                        "id": "2084032405"
                    },
                    {
                        "cid": "11054",
                        "cname": "滑雪",
                        "id": "25102"
                    },
                    {
                        "cid": "11055",
                        "cname": "有氧潜水",
                        "id": "25294"
                    },
                    {
                        "cid": "11056",
                        "cname": "滑板",
                        "id": "25318"
                    },
                    {
                        "cid": "11057",
                        "cname": "滑雪板",
                        "id": "25118"
                    },
                    {
                        "cid": "11058",
                        "cname": "动力雪橇",
                        "id": "25238"
                    },
                    {
                        "cid": "11059",
                        "cname": "垒球",
                        "id": "25352"
                    },
                    {
                        "cid": "11060",
                        "cname": "自行车/自行车运动",
                        "id": "26222"
                    },
                    {
                        "cid": "11061",
                        "cname": "柔道",
                        "id": "2084005448"
                    },
                    {
                        "cid": "11062",
                        "cname": "残疾人体育",
                        "id": "2084047835"
                    },
                    {
                        "cid": "11063",
                        "cname": "骑马/马术",
                        "id": "25230"
                    },
                    {
                        "cid": "11064",
                        "cname": "新体操",
                        "id": "2084259893"
                    },
                    {
                        "cid": "11065",
                        "cname": "游泳",
                        "id": "2084051833"
                    },
                    {
                        "cid": "11066",
                        "cname": "滑水",
                        "id": "25246"
                    },
                    {
                        "cid": "11067",
                        "cname": "相扑",
                        "id": "2084231476"
                    },
                    {
                        "cid": "11068",
                        "cname": "飞镖",
                        "id": "25856"
                    },
                    {
                        "cid": "11069",
                        "cname": "舞蹈/芭蕾舞",
                        "id": "2084047566"
                    },
                    {
                        "cid": "11070",
                        "cname": "网球",
                        "id": "2084032399"
                    },
                    {
                        "cid": "11071",
                        "cname": "铁人三项",
                        "id": "2084299350"
                    },
                    {
                        "cid": "11072",
                        "cname": "乒乓球",
                        "id": "25202"
                    },
                    {
                        "cid": "11073",
                        "cname": "登山用品",
                        "id": "24930"
                    },
                    {
                        "cid": "11074",
                        "cname": "手球",
                        "id": "2084048556"
                    },
                    {
                        "cid": "11075",
                        "cname": "篮球",
                        "id": "25338"
                    },
                    {
                        "cid": "11076",
                        "cname": "羽毛球",
                        "id": "2084005449"
                    },
                    {
                        "cid": "11077",
                        "cname": "排球",
                        "id": "25342"
                    },
                    {
                        "cid": "11078",
                        "cname": "滑翔机",
                        "id": "2084032408"
                    },
                    {
                        "cid": "11079",
                        "cname": "台球",
                        "id": "25204"
                    },
                    {
                        "cid": "11080",
                        "cname": "滚轴曲棍球",
                        "id": "25340"
                    },
                    {
                        "cid": "11081",
                        "cname": "室内足球",
                        "id": "2084244286"
                    },
                    {
                        "cid": "11082",
                        "cname": "保龄球",
                        "id": "25226"
                    },
                    {
                        "cid": "11083",
                        "cname": "拳击",
                        "id": "2084005450"
                    },
                    {
                        "cid": "11084",
                        "cname": "玩浪板",
                        "id": "2084032281"
                    },
                    {
                        "cid": "11085",
                        "cname": "瑜伽、普拉提",
                        "id": "2084196833"
                    },
                    {
                        "cid": "11086",
                        "cname": "棒球",
                        "id": "25336"
                    },
                    {
                        "cid": "11087",
                        "cname": "长曲棍球",
                        "id": "25348"
                    },
                    {
                        "cid": "11088",
                        "cname": "橄榄球",
                        "id": "25354"
                    },
                    {
                        "cid": "11089",
                        "cname": "跑步、慢跑",
                        "id": "2084285322"
                    },
                    {
                        "cid": "11090",
                        "cname": "攀岩",
                        "id": "25254"
                    },
                    {
                        "cid": "11091",
                        "cname": "陆上竞技",
                        "id": "25356"
                    },
                    {
                        "cid": "11092",
                        "cname": "运动服",
                        "id": "23008"
                    },
                    {
                        "cid": "11093",
                        "cname": "纪念品、相关商品",
                        "id": "25370"
                    },
                    {
                        "cid": "11094",
                        "cname": "其他",
                        "id": "25462"
                    }
                ]
            },
            {
                "cid": "11013",
                "cname": "露营/户外用品",
                "id": "24702",
                "children": [
                    {
                        "cid": "13019",
                        "cname": "户外运动服装",
                        "id": "24802"
                    },
                    {
                        "cid": "13020",
                        "cname": "雨具/雨衣",
                        "id": "2084046735"
                    },
                    {
                        "cid": "13021",
                        "cname": "鞋",
                        "id": "2084048872"
                    },
                    {
                        "cid": "13022",
                        "cname": "背包/包",
                        "id": "24750"
                    },
                    {
                        "cid": "13023",
                        "cname": "帐篷、篷布",
                        "id": "25014"
                    },
                    {
                        "cid": "13024",
                        "cname": "灯、彩灯",
                        "id": "24902"
                    },
                    {
                        "cid": "13025",
                        "cname": "睡袋/寝具",
                        "id": "24970"
                    },
                    {
                        "cid": "13026",
                        "cname": "桌子/椅子",
                        "id": "2084042504"
                    },
                    {
                        "cid": "13027",
                        "cname": "火炉/炉子",
                        "id": "2084042511"
                    },
                    {
                        "cid": "13028",
                        "cname": "烹饪器具",
                        "id": "24822"
                    },
                    {
                        "cid": "13029",
                        "cname": "燃料",
                        "id": "2084046750"
                    },
                    {
                        "cid": "13030",
                        "cname": "油箱/携带罐",
                        "id": "2084209093"
                    },
                    {
                        "cid": "13031",
                        "cname": "空调、保鲜器具",
                        "id": "2084044977"
                    },
                    {
                        "cid": "13032",
                        "cname": "餐具",
                        "id": "2084042502"
                    },
                    {
                        "cid": "13033",
                        "cname": "业余活动ー",
                        "id": "2084042422"
                    },
                    {
                        "cid": "13034",
                        "cname": "登山用品",
                        "id": "24930"
                    },
                    {
                        "cid": "13035",
                        "cname": "水瓶、瓶",
                        "id": "2084044978"
                    },
                    {
                        "cid": "13036",
                        "cname": "登山杖",
                        "id": "2084063019"
                    },
                    {
                        "cid": "13037",
                        "cname": "导航",
                        "id": "24950"
                    },
                    {
                        "cid": "13038",
                        "cname": "发电机",
                        "id": "2084049596"
                    },
                    {
                        "cid": "13039",
                        "cname": "刀",
                        "id": "24874"
                    },
                    {
                        "cid": "13040",
                        "cname": "独木舟、皮艇",
                        "id": "2084002306"
                    },
                    {
                        "cid": "13041",
                        "cname": "充气艇",
                        "id": "2084213349"
                    },
                    {
                        "cid": "13042",
                        "cname": "遮阳伞",
                        "id": "2084208695"
                    },
                    {
                        "cid": "13043",
                        "cname": "急救、卫生用品",
                        "id": "24854"
                    },
                    {
                        "cid": "13044",
                        "cname": "驱虫",
                        "id": "2084062800"
                    },
                    {
                        "cid": "13045",
                        "cname": "遮阳伞",
                        "id": "2084208878"
                    },
                    {
                        "cid": "13046",
                        "cname": "铲子",
                        "id": "2084209094"
                    },
                    {
                        "cid": "13047",
                        "cname": "贴纸",
                        "id": "2084208876"
                    },
                    {
                        "cid": "13048",
                        "cname": "双筒望远镜",
                        "id": "2084045042"
                    },
                    {
                        "cid": "13049",
                        "cname": "野营车",
                        "id": "2084049594"
                    },
                    {
                        "cid": "13050",
                        "cname": "户外",
                        "id": "2084008869"
                    },
                    {
                        "cid": "13051",
                        "cname": "露营/户外",
                        "id": "2084307765"
                    },
                    {
                        "cid": "13052",
                        "cname": "其他",
                        "id": "2084005102"
                    }
                ]
            },
            {
                "cid": "11014",
                "cname": "自行车",
                "id": "26222",
                "children": [
                    {
                        "cid": "13296",
                        "cname": "车身",
                        "id": "26246"
                    },
                    {
                        "cid": "13297",
                        "cname": "零件",
                        "id": "26260"
                    },
                    {
                        "cid": "13298",
                        "cname": "衣服",
                        "id": "2084032380"
                    },
                    {
                        "cid": "13299",
                        "cname": "包",
                        "id": "2084227170"
                    },
                    {
                        "cid": "13300",
                        "cname": "首饰",
                        "id": "26224"
                    },
                    {
                        "cid": "13301",
                        "cname": "工具/维修",
                        "id": "2084235676"
                    },
                    {
                        "cid": "13302",
                        "cname": "体育心跳表",
                        "id": "2084263701"
                    },
                    {
                        "cid": "13303",
                        "cname": "训练设备",
                        "id": "2084048299"
                    },
                    {
                        "cid": "13304",
                        "cname": "手持GPS",
                        "id": "2084259454"
                    },
                    {
                        "cid": "13305",
                        "cname": "自行车",
                        "id": "2084256904"
                    },
                    {
                        "cid": "13306",
                        "cname": "赛车",
                        "id": "2084048304"
                    },
                    {
                        "cid": "13307",
                        "cname": "自行车/自行车",
                        "id": "2084047997"
                    },
                    {
                        "cid": "13308",
                        "cname": "自行车",
                        "id": "2084307766"
                    },
                    {
                        "cid": "13309",
                        "cname": "其他",
                        "id": "2084047573"
                    }
                ]
            },
            {
                "cid": "11015",
                "cname": "钓鱼",
                "id": "25180",
                "children": [
                    {
                        "cid": "13574",
                        "cname": "竿",
                        "id": "2084005512"
                    },
                    {
                        "cid": "13575",
                        "cname": "渔轮",
                        "id": "25182"
                    },
                    {
                        "cid": "13576",
                        "cname": "毛钩用品",
                        "id": "25192"
                    },
                    {
                        "cid": "13577",
                        "cname": "衣服",
                        "id": "2084046953"
                    },
                    {
                        "cid": "13578",
                        "cname": "工具箱",
                        "id": "25188"
                    },
                    {
                        "cid": "13579",
                        "cname": "钓鱼线/线",
                        "id": "2084048285"
                    },
                    {
                        "cid": "13580",
                        "cname": "鱼钩",
                        "id": "2084203064"
                    },
                    {
                        "cid": "13581",
                        "cname": "浮标",
                        "id": "2084047891"
                    },
                    {
                        "cid": "13582",
                        "cname": "诱饵",
                        "id": "2084302928"
                    },
                    {
                        "cid": "13583",
                        "cname": "油炸用品",
                        "id": "25184"
                    },
                    {
                        "cid": "13584",
                        "cname": "香鱼用品",
                        "id": "2084047892"
                    },
                    {
                        "cid": "13585",
                        "cname": "首饰",
                        "id": "25194"
                    },
                    {
                        "cid": "13586",
                        "cname": "鱼竿支架",
                        "id": "2084259313"
                    },
                    {
                        "cid": "13587",
                        "cname": "船/小船",
                        "id": "26214"
                    },
                    {
                        "cid": "13588",
                        "cname": "鱼群探测器",
                        "id": "2084045133"
                    },
                    {
                        "cid": "13589",
                        "cname": "钓鱼",
                        "id": "2084046841"
                    },
                    {
                        "cid": "13590",
                        "cname": "钓鱼/钓鱼",
                        "id": "2084008870"
                    },
                    {
                        "cid": "13591",
                        "cname": "游民",
                        "id": "2084047681"
                    },
                    {
                        "cid": "13592",
                        "cname": "其他",
                        "id": "25196"
                    }
                ]
            },
            {
                "cid": "11016",
                "cname": "运动服",
                "id": "23008",
                "children": [
                    {
                        "cid": "13864",
                        "cname": "男性用的",
                        "id": "2084005276"
                    },
                    {
                        "cid": "13865",
                        "cname": "女性用",
                        "id": "2084006829"
                    },
                    {
                        "cid": "13866",
                        "cname": "男女兼用",
                        "id": "2084024291"
                    },
                    {
                        "cid": "13867",
                        "cname": "孩子用",
                        "id": "2084024292"
                    },
                    {
                        "cid": "13868",
                        "cname": "体育不同",
                        "id": "25152"
                    },
                    {
                        "cid": "13869",
                        "cname": "体育太阳镜",
                        "id": "2084214045"
                    },
                    {
                        "cid": "13870",
                        "cname": "户外运动服装",
                        "id": "24802"
                    },
                    {
                        "cid": "13871",
                        "cname": "衫",
                        "id": "2084006766"
                    },
                    {
                        "cid": "13872",
                        "cname": "游泳衣",
                        "id": "2084051883"
                    }
                ]
            },
            {
                "cid": "11017",
                "cname": "户外服装",
                "id": "24802",
                "children": [
                    {
                        "cid": "14125",
                        "cname": "品牌分类",
                        "id": "2084057251"
                    },
                    {
                        "cid": "14126",
                        "cname": "男性用的",
                        "id": "2084057221"
                    },
                    {
                        "cid": "14127",
                        "cname": "女性用",
                        "id": "2084057222"
                    },
                    {
                        "cid": "14128",
                        "cname": "孩子用",
                        "id": "2084057223"
                    },
                    {
                        "cid": "14129",
                        "cname": "体育太阳镜",
                        "id": "2084214045"
                    },
                    {
                        "cid": "14130",
                        "cname": "雨具/雨衣",
                        "id": "2084046735"
                    },
                    {
                        "cid": "14131",
                        "cname": "鞋",
                        "id": "2084048872"
                    },
                    {
                        "cid": "14132",
                        "cname": "服饰小东西",
                        "id": "2084057242"
                    }
                ]
            },
            {
                "cid": "11019",
                "cname": "运动监测",
                "id": "2084263701",
                "children": []
            },
            {
                "cid": "11020",
                "cname": "眼镜",
                "id": "2084214045",
                "children": [
                    {
                        "cid": "14417",
                        "cname": "OGK",
                        "id": "2084246695"
                    },
                    {
                        "cid": "14418",
                        "cname": "zerorh +",
                        "id": "2084246694"
                    },
                    {
                        "cid": "14419",
                        "cname": "Arnett",
                        "id": "2084214052"
                    },
                    {
                        "cid": "14420",
                        "cname": "AXE",
                        "id": "2084214050"
                    },
                    {
                        "cid": "14421",
                        "cname": "adidas（阿迪达斯）",
                        "id": "2084214047"
                    },
                    {
                        "cid": "14422",
                        "cname": "Oakley（欧克利）",
                        "id": "2084214334"
                    },
                    {
                        "cid": "14423",
                        "cname": "Coleman",
                        "id": "2084214053"
                    },
                    {
                        "cid": "14424",
                        "cname": "SPY",
                        "id": "2084214051"
                    },
                    {
                        "cid": "14425",
                        "cname": "斯伯丁",
                        "id": "2084246696"
                    },
                    {
                        "cid": "14426",
                        "cname": "SWANS",
                        "id": "2084214054"
                    },
                    {
                        "cid": "14427",
                        "cname": "NIKE（耐克）",
                        "id": "2084214046"
                    },
                    {
                        "cid": "14428",
                        "cname": "BLACK FLYS",
                        "id": "2084214055"
                    },
                    {
                        "cid": "14429",
                        "cname": "BRIKO",
                        "id": "2084214049"
                    },
                    {
                        "cid": "14430",
                        "cname": "RUDY PROJECT",
                        "id": "2084214057"
                    },
                    {
                        "cid": "14431",
                        "cname": "Ray-Ban（雷朋）",
                        "id": "2084214048"
                    },
                    {
                        "cid": "14432",
                        "cname": "其他",
                        "id": "2084214056"
                    }
                ]
            },
            {
                "cid": "11021",
                "cname": "玩水",
                "id": "2084042420",
                "children": [
                    {
                        "cid": "9141",
                        "cname": "救生圈/浮具",
                        "id": "2084042423"
                    },
                    {
                        "cid": "9142",
                        "cname": "充气艇",
                        "id": "2084044885"
                    },
                    {
                        "cid": "9143",
                        "cname": "遮阳伞",
                        "id": "2084208878"
                    },
                    {
                        "cid": "9144",
                        "cname": "海滩球",
                        "id": "2084042424"
                    },
                    {
                        "cid": "9145",
                        "cname": "业余活动ー",
                        "id": "2084042422"
                    },
                    {
                        "cid": "9146",
                        "cname": "家用泳池",
                        "id": "2084042421"
                    },
                    {
                        "cid": "9147",
                        "cname": "水枪",
                        "id": "2084042425"
                    },
                    {
                        "cid": "9148",
                        "cname": "游泳池",
                        "id": "2084042176"
                    }
                ]
            },
			{
                "cid": "11033",
                "cname": "户外休闲",
                "id": "2084307762",
                "children": [
                    {
                        "cid": "48331",
                        "cname": "露营/户外",
                        "id": "2084307765"
                    },
                    {
                        "cid": "48332",
                        "cname": "自行车",
                        "id": "2084307766"
                    },
                    {
                        "cid": "48333",
                        "cname": "滑雪/滑雪板",
                        "id": "2084307767"
                    }
                ]
            },
            {
                "cid": "11034",
                "cname": "其他",
                "id": "2084036434",
                "children": []
            }
        ]
    },
	
    {
        "cid": "11",
        "cname": "服饰鞋帽包包香水",
        "id": "23000",
        "children": [
            {
                "cid": "20307",
                "cname": "品牌分类",
                "id": "23172",
                "children": [
                    {
                        "cid": "20329",
                        "cname": "あ",
                        "id": "2084061507"
                    },
                    {
                        "cid": "20330",
                        "cname": "い",
                        "id": "2084061508"
                    },
                    {
                        "cid": "20331",
                        "cname": "う",
                        "id": "2084061509"
                    },
                    {
                        "cid": "20332",
                        "cname": "え",
                        "id": "2084061510"
                    },
                    {
                        "cid": "20333",
                        "cname": "お",
                        "id": "2084061511"
                    },
                    {
                        "cid": "20334",
                        "cname": "か",
                        "id": "2084061534"
                    },
                    {
                        "cid": "20335",
                        "cname": "き",
                        "id": "2084061535"
                    },
                    {
                        "cid": "20336",
                        "cname": "く",
                        "id": "2084061536"
                    },
                    {
                        "cid": "20337",
                        "cname": "け",
                        "id": "2084061537"
                    },
                    {
                        "cid": "20338",
                        "cname": "こ",
                        "id": "2084061538"
                    },
                    {
                        "cid": "20339",
                        "cname": "さ",
                        "id": "2084061551"
                    },
                    {
                        "cid": "20340",
                        "cname": "し",
                        "id": "2084061552"
                    },
                    {
                        "cid": "20341",
                        "cname": "す",
                        "id": "2084061553"
                    },
                    {
                        "cid": "20342",
                        "cname": "せ/そ",
                        "id": "2084061554"
                    },
                    {
                        "cid": "20343",
                        "cname": "た/ち/つ",
                        "id": "2084061652"
                    },
                    {
                        "cid": "20344",
                        "cname": "て",
                        "id": "2084061655"
                    },
                    {
                        "cid": "20345",
                        "cname": "と",
                        "id": "2084061656"
                    },
                    {
                        "cid": "20346",
                        "cname": "な～の",
                        "id": "2084050157"
                    },
                    {
                        "cid": "20347",
                        "cname": "は",
                        "id": "2084061663"
                    },
                    {
                        "cid": "20348",
                        "cname": "ひ",
                        "id": "2084061664"
                    },
                    {
                        "cid": "20349",
                        "cname": "ふ",
                        "id": "2084061665"
                    },
                    {
                        "cid": "20350",
                        "cname": "へ",
                        "id": "2084061666"
                    },
                    {
                        "cid": "20351",
                        "cname": "ほ",
                        "id": "2084061667"
                    },
                    {
                        "cid": "20352",
                        "cname": "ま",
                        "id": "2084061759"
                    },
                    {
                        "cid": "20353",
                        "cname": "み",
                        "id": "2084061760"
                    },
                    {
                        "cid": "20354",
                        "cname": "む/め/も",
                        "id": "2084061762"
                    },
                    {
                        "cid": "20355",
                        "cname": "や/ゆ/よ",
                        "id": "2084050160"
                    },
                    {
                        "cid": "20356",
                        "cname": "ら",
                        "id": "2084061764"
                    },
                    {
                        "cid": "20357",
                        "cname": "り",
                        "id": "2084061765"
                    },
                    {
                        "cid": "20358",
                        "cname": "る",
                        "id": "2084061766"
                    },
                    {
                        "cid": "20359",
                        "cname": "れ",
                        "id": "2084061767"
                    },
                    {
                        "cid": "20360",
                        "cname": "ろ",
                        "id": "2084061768"
                    },
                    {
                        "cid": "20361",
                        "cname": "わ",
                        "id": "2084050162"
                    }
                ]
            },
            {
                "cid": "20308",
                "cname": "女装",
                "id": "23288",
                "children": [
                    {
                        "cid": "30062",
                        "cname": "大衣",
                        "id": "2084005207"
                    },
                    {
                        "cid": "30063",
                        "cname": "夹克、上衣",
                        "id": "23308"
                    },
                    {
                        "cid": "30064",
                        "cname": "对襟毛衣",
                        "id": "2084005211"
                    },
                    {
                        "cid": "30065",
                        "cname": "编织物",
                        "id": "2084007139"
                    },
                    {
                        "cid": "30066",
                        "cname": "针织/毛衣",
                        "id": "2084005283"
                    },
                    {
                        "cid": "30067",
                        "cname": "精选",
                        "id": "2084007141"
                    },
                    {
                        "cid": "30068",
                        "cname": "训练服",
                        "id": "2084007140"
                    },
                    {
                        "cid": "30069",
                        "cname": "针织衫",
                        "id": "2084007127"
                    },
                    {
                        "cid": "30070",
                        "cname": "衬衫",
                        "id": "42184"
                    },
                    {
                        "cid": "30071",
                        "cname": "上衣",
                        "id": "2084231768"
                    },
                    {
                        "cid": "30072",
                        "cname": "T恤",
                        "id": "2084005452"
                    },
                    {
                        "cid": "30073",
                        "cname": "短袖衬衫",
                        "id": "2084007142"
                    },
                    {
                        "cid": "30074",
                        "cname": "细吊带小背心",
                        "id": "2084064258"
                    },
                    {
                        "cid": "30075",
                        "cname": "背心",
                        "id": "2084064257"
                    },
                    {
                        "cid": "30076",
                        "cname": "抹胸/露背装",
                        "id": "2084243344"
                    },
                    {
                        "cid": "30077",
                        "cname": "连衣裙",
                        "id": "2084007151"
                    },
                    {
                        "cid": "30078",
                        "cname": "裙子",
                        "id": "42183"
                    },
                    {
                        "cid": "30079",
                        "cname": "裤、裤子",
                        "id": "2084007160"
                    },
                    {
                        "cid": "30080",
                        "cname": "斜纹粗棉布/牛仔裤",
                        "id": "23300"
                    },
                    {
                        "cid": "30081",
                        "cname": "工人裤/画家裤",
                        "id": "2084036998"
                    },
                    {
                        "cid": "30082",
                        "cname": "短裤",
                        "id": "2084007159"
                    },
                    {
                        "cid": "30083",
                        "cname": "短紧身裤/七分裤",
                        "id": "2084007163"
                    },
                    {
                        "cid": "30084",
                        "cname": "工作服/工作服",
                        "id": "2084047537"
                    },
                    {
                        "cid": "30085",
                        "cname": "裙裤",
                        "id": "2084007158"
                    },
                    {
                        "cid": "30086",
                        "cname": "休闲裤",
                        "id": "2084007162"
                    },
                    {
                        "cid": "30087",
                        "cname": "低裆裤",
                        "id": "2084246107"
                    },
                    {
                        "cid": "30088",
                        "cname": "套装",
                        "id": "2084007153"
                    },
                    {
                        "cid": "30089",
                        "cname": "正规",
                        "id": "23292"
                    },
                    {
                        "cid": "30090",
                        "cname": "打底裤/踩脚袜",
                        "id": "2084007161"
                    },
                    {
                        "cid": "30091",
                        "cname": "保暖内衣",
                        "id": "2084053081"
                    },
                    {
                        "cid": "30092",
                        "cname": "睡衣、睡衣",
                        "id": "2084053160"
                    },
                    {
                        "cid": "30093",
                        "cname": "泳装",
                        "id": "2084051829"
                    },
                    {
                        "cid": "30094",
                        "cname": "孕妇服",
                        "id": "2084006309"
                    },
                    {
                        "cid": "30095",
                        "cname": "流行小东西",
                        "id": "2084005287"
                    },
                    {
                        "cid": "30096",
                        "cname": "工作服",
                        "id": "2084047504"
                    },
                    {
                        "cid": "30097",
                        "cname": "女士",
                        "id": "2084307771"
                    },
                    {
                        "cid": "30098",
                        "cname": "其他",
                        "id": "23316"
                    }
                ]
            },
            {
                "cid": "20309",
                "cname": "女包",
                "id": "2084005069",
                "children": [
                    {
                        "cid": "32345",
                        "cname": "挎包",
                        "id": "2084008313"
                    },
                    {
                        "cid": "32346",
                        "cname": "大手提袋",
                        "id": "2084008314"
                    },
                    {
                        "cid": "32347",
                        "cname": "手提包",
                        "id": "2084008315"
                    },
                    {
                        "cid": "32348",
                        "cname": "化妆包",
                        "id": "2084007482"
                    },
                    {
                        "cid": "32349",
                        "cname": "环保袋",
                        "id": "2084233235"
                    },
                    {
                        "cid": "32350",
                        "cname": "公文包",
                        "id": "2084008337"
                    },
                    {
                        "cid": "32351",
                        "cname": "腰包",
                        "id": "2084008312"
                    },
                    {
                        "cid": "32352",
                        "cname": "离合器袋包/聚会",
                        "id": "2084008347"
                    },
                    {
                        "cid": "32353",
                        "cname": "手提箱/皮箱",
                        "id": "2084008297"
                    },
                    {
                        "cid": "32354",
                        "cname": "小包",
                        "id": "2084008318"
                    },
                    {
                        "cid": "32355",
                        "cname": "篮子/藤筐",
                        "id": "2084008307"
                    },
                    {
                        "cid": "32356",
                        "cname": "化妆包",
                        "id": "2084008306"
                    },
                    {
                        "cid": "32357",
                        "cname": "公文包、文件包",
                        "id": "2084008333"
                    },
                    {
                        "cid": "32358",
                        "cname": "旅行袋",
                        "id": "2084008310"
                    },
                    {
                        "cid": "32359",
                        "cname": "车身手提包",
                        "id": "2084008348"
                    },
                    {
                        "cid": "32360",
                        "cname": "小型挎包",
                        "id": "2084050512"
                    },
                    {
                        "cid": "32361",
                        "cname": "育儿包",
                        "id": "2084047405"
                    },
                    {
                        "cid": "32362",
                        "cname": "帆布背包/背包",
                        "id": "2084008316"
                    },
                    {
                        "cid": "32363",
                        "cname": "荷包",
                        "id": "2084008317"
                    },
                    {
                        "cid": "32364",
                        "cname": "巾着/小包",
                        "id": "2084005470"
                    },
                    {
                        "cid": "32365",
                        "cname": "钥匙包",
                        "id": "2084012476"
                    },
                    {
                        "cid": "32366",
                        "cname": "情况",
                        "id": "2084008418"
                    },
                    {
                        "cid": "32367",
                        "cname": "女性用",
                        "id": "2084005289"
                    },
                    {
                        "cid": "32368",
                        "cname": "卡套",
                        "id": "2084012475"
                    },
                    {
                        "cid": "32369",
                        "cname": "包/手提箱",
                        "id": "2084307774"
                    }
                ]
            },
            {
                "cid": "20310",
                "cname": "女鞋",
                "id": "23312",
                "children": [
                    {
                        "cid": "32415",
                        "cname": "徒步鞋",
                        "id": "2084023781"
                    },
                    {
                        "cid": "32416",
                        "cname": "凉鞋",
                        "id": "2084005497"
                    },
                    {
                        "cid": "32417",
                        "cname": "运动鞋",
                        "id": "2084005494"
                    },
                    {
                        "cid": "32418",
                        "cname": "芭蕾舞鞋",
                        "id": "2084023780"
                    },
                    {
                        "cid": "32419",
                        "cname": "高跟鞋",
                        "id": "2084005493"
                    },
                    {
                        "cid": "32420",
                        "cname": "靴子",
                        "id": "2084005495"
                    },
                    {
                        "cid": "32421",
                        "cname": "拖鞋",
                        "id": "2084005496"
                    },
                    {
                        "cid": "32422",
                        "cname": "平底皮鞋/皮鞋",
                        "id": "2084007894"
                    },
                    {
                        "cid": "32423",
                        "cname": "木屐/凉鞋",
                        "id": "2084005469"
                    },
                    {
                        "cid": "32424",
                        "cname": "女性用",
                        "id": "42187"
                    },
                    {
                        "cid": "32425",
                        "cname": "工作鞋",
                        "id": "2084048894"
                    },
                    {
                        "cid": "32426",
                        "cname": "长靴/Rain鞋",
                        "id": "2084023779"
                    },
                    {
                        "cid": "32427",
                        "cname": "鞋",
                        "id": "2084048872"
                    },
                    {
                        "cid": "32428",
                        "cname": "フットケア",
                        "id": "2084005299"
                    },
                    {
                        "cid": "32429",
                        "cname": "鞋用品",
                        "id": "2084238534"
                    },
                    {
                        "cid": "32430",
                        "cname": "其他",
                        "id": "2084005499"
                    }
                ]
            },
            {
                "cid": "20311",
                "cname": "女性和服",
                "id": "2084005204",
                "children": [
                    {
                        "cid": "32690",
                        "cname": "簪",
                        "id": "2084048833"
                    },
                    {
                        "cid": "32691",
                        "cname": "巾着/小包",
                        "id": "2084005470"
                    },
                    {
                        "cid": "32692",
                        "cname": "外衣,道中着",
                        "id": "2084005473"
                    },
                    {
                        "cid": "32693",
                        "cname": "木屐/凉鞋",
                        "id": "2084005469"
                    },
                    {
                        "cid": "32694",
                        "cname": "小纹",
                        "id": "2084005465"
                    },
                    {
                        "cid": "32695",
                        "cname": "色无地",
                        "id": "2084005466"
                    },
                    {
                        "cid": "32696",
                        "cname": "振袖和服",
                        "id": "2084005461"
                    },
                    {
                        "cid": "32697",
                        "cname": "带",
                        "id": "2084005468"
                    },
                    {
                        "cid": "32698",
                        "cname": "紬/御召",
                        "id": "2084048387"
                    },
                    {
                        "cid": "32699",
                        "cname": "付下",
                        "id": "2084005464"
                    },
                    {
                        "cid": "32700",
                        "cname": "访问着",
                        "id": "2084005463"
                    },
                    {
                        "cid": "32701",
                        "cname": "浴衣",
                        "id": "2084005467"
                    },
                    {
                        "cid": "32702",
                        "cname": "留袖和服",
                        "id": "2084005462"
                    },
                    {
                        "cid": "32703",
                        "cname": "长襦袢",
                        "id": "2084059847"
                    },
                    {
                        "cid": "32704",
                        "cname": "和服内衣服装",
                        "id": "2084061635"
                    },
                    {
                        "cid": "32705",
                        "cname": "日式小饰品",
                        "id": "2084005472"
                    },
                    {
                        "cid": "32706",
                        "cname": "古董",
                        "id": "2084311305"
                    },
                    {
                        "cid": "32707",
                        "cname": "小袖衬衫",
                        "id": "2084307760"
                    },
                    {
                        "cid": "32708",
                        "cname": "其他",
                        "id": "2084005474"
                    }
                ]
            },
            {
                "cid": "20312",
                "cname": "时尚配饰",
                "id": "23004",
                "children": [
                    {
                        "cid": "32778",
                        "cname": "钱包",
                        "id": "2084012467"
                    },
                    {
                        "cid": "32779",
                        "cname": "卡套",
                        "id": "2084012475"
                    },
                    {
                        "cid": "32780",
                        "cname": "钥匙包",
                        "id": "2084012476"
                    },
                    {
                        "cid": "32781",
                        "cname": "扇子",
                        "id": "2084045070"
                    },
                    {
                        "cid": "32782",
                        "cname": "扇子",
                        "id": "2084045073"
                    },
                    {
                        "cid": "32783",
                        "cname": "小方绸巾",
                        "id": "2084061202"
                    },
                    {
                        "cid": "32784",
                        "cname": "包袱布",
                        "id": "2084061203"
                    },
                    {
                        "cid": "32785",
                        "cname": "雨伞",
                        "id": "2084012468"
                    },
                    {
                        "cid": "32786",
                        "cname": "遮阳伞",
                        "id": "2084045162"
                    },
                    {
                        "cid": "32787",
                        "cname": "帽子",
                        "id": "2084012470"
                    },
                    {
                        "cid": "32788",
                        "cname": "隐形眼镜",
                        "id": "2084012478"
                    },
                    {
                        "cid": "32789",
                        "cname": "墨镜",
                        "id": "42542"
                    },
                    {
                        "cid": "32790",
                        "cname": "ウイッグ",
                        "id": "2084007438"
                    },
                    {
                        "cid": "32791",
                        "cname": "围裙",
                        "id": "2084018499"
                    },
                    {
                        "cid": "32792",
                        "cname": "钥匙链/钱包链子",
                        "id": "2084023760"
                    },
                    {
                        "cid": "32793",
                        "cname": "钥匙扣",
                        "id": "40427"
                    },
                    {
                        "cid": "32794",
                        "cname": "头花",
                        "id": "2084012460"
                    },
                    {
                        "cid": "32795",
                        "cname": "吊带",
                        "id": "2084012471"
                    },
                    {
                        "cid": "32796",
                        "cname": "丝袜",
                        "id": "2084053097"
                    },
                    {
                        "cid": "32797",
                        "cname": "紧身裤",
                        "id": "2084245566"
                    },
                    {
                        "cid": "32798",
                        "cname": "纸巾套",
                        "id": "2084049723"
                    },
                    {
                        "cid": "32799",
                        "cname": "领带",
                        "id": "2084005273"
                    },
                    {
                        "cid": "32800",
                        "cname": "手绢",
                        "id": "2084012462"
                    },
                    {
                        "cid": "32801",
                        "cname": "带扣",
                        "id": "2084023706"
                    },
                    {
                        "cid": "32802",
                        "cname": "印花大手帕",
                        "id": "2084012474"
                    },
                    {
                        "cid": "32803",
                        "cname": "皮带",
                        "id": "2084012463"
                    },
                    {
                        "cid": "32804",
                        "cname": "钱夹",
                        "id": "2084023711"
                    },
                    {
                        "cid": "32805",
                        "cname": "吸烟商品",
                        "id": "26126"
                    },
                    {
                        "cid": "32806",
                        "cname": "袜子",
                        "id": "2084012466"
                    },
                    {
                        "cid": "32807",
                        "cname": "情况",
                        "id": "2084008418"
                    },
                    {
                        "cid": "32808",
                        "cname": "手机挂件",
                        "id": "2084005064"
                    },
                    {
                        "cid": "32809",
                        "cname": "手册",
                        "id": "2084024227"
                    },
                    {
                        "cid": "32810",
                        "cname": "杖/拐杖",
                        "id": "2084012480"
                    },
                    {
                        "cid": "32811",
                        "cname": "名片盒/卡片匣",
                        "id": "2084246780"
                    },
                    {
                        "cid": "32812",
                        "cname": "围巾、手帕",
                        "id": "2084012465"
                    },
                    {
                        "cid": "32813",
                        "cname": "披肩",
                        "id": "2084006453"
                    },
                    {
                        "cid": "32814",
                        "cname": "围巾",
                        "id": "2084012464"
                    },
                    {
                        "cid": "32815",
                        "cname": "手套",
                        "id": "2084012469"
                    },
                    {
                        "cid": "32816",
                        "cname": "其他",
                        "id": "44164"
                    }
                ]
            },
            {
                "cid": "20313",
                "cname": "男装",
                "id": "23176",
                "children": [
                    {
                        "cid": "33018",
                        "cname": "大衣",
                        "id": "2084007042"
                    },
                    {
                        "cid": "33019",
                        "cname": "夹克、上衣",
                        "id": "23196"
                    },
                    {
                        "cid": "33020",
                        "cname": "对襟毛衣",
                        "id": "2084007052"
                    },
                    {
                        "cid": "33021",
                        "cname": "针织/毛衣",
                        "id": "2084005282"
                    },
                    {
                        "cid": "33022",
                        "cname": "精选",
                        "id": "2084007053"
                    },
                    {
                        "cid": "33023",
                        "cname": "训练服",
                        "id": "2084007051"
                    },
                    {
                        "cid": "33024",
                        "cname": "衬衫",
                        "id": "42189"
                    },
                    {
                        "cid": "33025",
                        "cname": "短袖衬衫",
                        "id": "2084007048"
                    },
                    {
                        "cid": "33026",
                        "cname": "T恤",
                        "id": "2084005451"
                    },
                    {
                        "cid": "33027",
                        "cname": "背心",
                        "id": "2084007047"
                    },
                    {
                        "cid": "33028",
                        "cname": "牛仔裤",
                        "id": "23188"
                    },
                    {
                        "cid": "33029",
                        "cname": "裤、裤子",
                        "id": "2084007077"
                    },
                    {
                        "cid": "33030",
                        "cname": "工人裤/画家裤",
                        "id": "2084036999"
                    },
                    {
                        "cid": "33031",
                        "cname": "休闲裤",
                        "id": "2084007082"
                    },
                    {
                        "cid": "33032",
                        "cname": "短裤",
                        "id": "2084007081"
                    },
                    {
                        "cid": "33033",
                        "cname": "工作服",
                        "id": "2084047538"
                    },
                    {
                        "cid": "33034",
                        "cname": "低裆裤",
                        "id": "2084246078"
                    },
                    {
                        "cid": "33035",
                        "cname": "套装",
                        "id": "2084007041"
                    },
                    {
                        "cid": "33036",
                        "cname": "流行小东西",
                        "id": "2084005270"
                    },
                    {
                        "cid": "33037",
                        "cname": "保暖内衣",
                        "id": "42190"
                    },
                    {
                        "cid": "33038",
                        "cname": "睡衣",
                        "id": "2084006762"
                    },
                    {
                        "cid": "33039",
                        "cname": "正规",
                        "id": "23180"
                    },
                    {
                        "cid": "33040",
                        "cname": "泳装",
                        "id": "2084051828"
                    },
                    {
                        "cid": "33041",
                        "cname": "工作服",
                        "id": "2084047504"
                    },
                    {
                        "cid": "33042",
                        "cname": "男士",
                        "id": "2084307770"
                    },
                    {
                        "cid": "33043",
                        "cname": "其他",
                        "id": "2084207680"
                    }
                ]
            },
            {
                "cid": "20314",
                "cname": "男包",
                "id": "2084006467",
                "children": [
                    {
                        "cid": "33921",
                        "cname": "挎包",
                        "id": "2084008300"
                    },
                    {
                        "cid": "33922",
                        "cname": "公文包、文件包",
                        "id": "2084008334"
                    },
                    {
                        "cid": "33923",
                        "cname": "帆布背包/背包",
                        "id": "2084008303"
                    },
                    {
                        "cid": "33924",
                        "cname": "腰包",
                        "id": "2084008299"
                    },
                    {
                        "cid": "33925",
                        "cname": "大手提袋",
                        "id": "2084008301"
                    },
                    {
                        "cid": "33926",
                        "cname": "公文包",
                        "id": "2084008337"
                    },
                    {
                        "cid": "33927",
                        "cname": "手提箱/皮箱",
                        "id": "2084008297"
                    },
                    {
                        "cid": "33928",
                        "cname": "小包",
                        "id": "2084008304"
                    },
                    {
                        "cid": "33929",
                        "cname": "手提包",
                        "id": "2084008302"
                    },
                    {
                        "cid": "33930",
                        "cname": "旅行袋",
                        "id": "2084008298"
                    },
                    {
                        "cid": "33931",
                        "cname": "车身手提包",
                        "id": "2084008349"
                    },
                    {
                        "cid": "33932",
                        "cname": "信使袋",
                        "id": "2084227171"
                    },
                    {
                        "cid": "33933",
                        "cname": "皮包",
                        "id": "2084235254"
                    },
                    {
                        "cid": "33934",
                        "cname": "情况",
                        "id": "2084008418"
                    },
                    {
                        "cid": "33935",
                        "cname": "钥匙包",
                        "id": "2084012476"
                    },
                    {
                        "cid": "33936",
                        "cname": "男性用的",
                        "id": "2084005274"
                    },
                    {
                        "cid": "33937",
                        "cname": "卡套",
                        "id": "2084012475"
                    },
                    {
                        "cid": "33938",
                        "cname": "包/手提箱",
                        "id": "2084307774"
                    }
                ]
            },
            {
                "cid": "20315",
                "cname": "男鞋",
                "id": "23200",
                "children": [
                    {
                        "cid": "33939",
                        "cname": "运动鞋",
                        "id": "2084005483"
                    },
                    {
                        "cid": "33940",
                        "cname": "凉鞋",
                        "id": "2084005485"
                    },
                    {
                        "cid": "33941",
                        "cname": "靴子",
                        "id": "2084005484"
                    },
                    {
                        "cid": "33942",
                        "cname": "懒汉鞋",
                        "id": "2084237296"
                    },
                    {
                        "cid": "33943",
                        "cname": "商务鞋",
                        "id": "2084005482"
                    },
                    {
                        "cid": "33944",
                        "cname": "甲板鞋",
                        "id": "2084232919"
                    },
                    {
                        "cid": "33945",
                        "cname": "徒步鞋",
                        "id": "2084062282"
                    },
                    {
                        "cid": "33946",
                        "cname": "长靴/Rain鞋",
                        "id": "2084023778"
                    },
                    {
                        "cid": "33947",
                        "cname": "工作鞋",
                        "id": "2084048894"
                    },
                    {
                        "cid": "33948",
                        "cname": "鞋",
                        "id": "2084005558"
                    },
                    {
                        "cid": "33949",
                        "cname": "木屐/凉鞋",
                        "id": "2084045102"
                    },
                    {
                        "cid": "33950",
                        "cname": "鞋",
                        "id": "2084048872"
                    },
                    {
                        "cid": "33951",
                        "cname": "フットケア",
                        "id": "2084005299"
                    },
                    {
                        "cid": "33952",
                        "cname": "男性用的",
                        "id": "42191"
                    },
                    {
                        "cid": "33953",
                        "cname": "鞋用品",
                        "id": "2084238534"
                    },
                    {
                        "cid": "33954",
                        "cname": "其他",
                        "id": "2084005486"
                    }
                ]
            },
            {
                "cid": "20316",
                "cname": "男士和服",
                "id": "2084005479",
                "children": [
                    {
                        "cid": "34305",
                        "cname": "普通",
                        "id": "2084045098"
                    },
                    {
                        "cid": "34306",
                        "cname": "木屐/凉鞋",
                        "id": "2084045102"
                    },
                    {
                        "cid": "34307",
                        "cname": "和尚的工作服",
                        "id": "2084045101"
                    },
                    {
                        "cid": "34308",
                        "cname": "甚平",
                        "id": "2084045100"
                    },
                    {
                        "cid": "34309",
                        "cname": "带",
                        "id": "2084045103"
                    },
                    {
                        "cid": "34310",
                        "cname": "浴衣",
                        "id": "2084045099"
                    },
                    {
                        "cid": "34311",
                        "cname": "长襦袢",
                        "id": "2084059848"
                    },
                    {
                        "cid": "34312",
                        "cname": "兜裆布",
                        "id": "2084061633"
                    },
                    {
                        "cid": "34313",
                        "cname": "日式小饰品",
                        "id": "2084061631"
                    }
                ]
            },
            {
                "cid": "20317",
                "cname": "男女兼用包",
                "id": "2084233229",
                "children": [
                    {
                        "cid": "34341",
                        "cname": "腰包",
                        "id": "2084233230"
                    },
                    {
                        "cid": "34342",
                        "cname": "环保袋",
                        "id": "2084233235"
                    },
                    {
                        "cid": "34343",
                        "cname": "挎包",
                        "id": "2084233231"
                    },
                    {
                        "cid": "34344",
                        "cname": "大手提袋",
                        "id": "2084233232"
                    },
                    {
                        "cid": "34345",
                        "cname": "旅行袋",
                        "id": "2084233234"
                    },
                    {
                        "cid": "34346",
                        "cname": "皮包",
                        "id": "2084235254"
                    },
                    {
                        "cid": "34347",
                        "cname": "帆布背包/背包",
                        "id": "2084233233"
                    }
                ]
            },
            {
                "cid": "20318",
                "cname": "儿童服饰",
                "id": "2084293011",
                "children": [
                    {
                        "cid": "34348",
                        "cname": "品牌分类",
                        "id": "2084293012"
                    },
                    {
                        "cid": "34349",
                        "cname": "孩子的衣服（女性用）",
                        "id": "2084006381"
                    },
                    {
                        "cid": "34350",
                        "cname": "孩子的衣服（男孩用）",
                        "id": "2084006380"
                    },
                    {
                        "cid": "34351",
                        "cname": "孩子的衣服（男女兼用）",
                        "id": "2084053274"
                    },
                    {
                        "cid": "34352",
                        "cname": "儿童鞋",
                        "id": "42195"
                    },
                    {
                        "cid": "34353",
                        "cname": "孩子用包",
                        "id": "2084007058"
                    },
                    {
                        "cid": "34354",
                        "cname": "孩子用流行小东西",
                        "id": "2084006428"
                    },
                    {
                        "cid": "34355",
                        "cname": "婴儿服",
                        "id": "24210"
                    },
                    {
                        "cid": "34356",
                        "cname": "婴儿鞋",
                        "id": "2084005310"
                    },
                    {
                        "cid": "34357",
                        "cname": "婴儿用流行小东西",
                        "id": "2084007254"
                    },
                    {
                        "cid": "34358",
                        "cname": "儿童",
                        "id": "2084307772"
                    }
                ]
            },
            {
                "cid": "20320",
                "cname": "手工",
                "id": "2084240597",
                "children": [
                    {
                        "cid": "37445",
                        "cname": "婴儿",
                        "id": "2084240602"
                    },
                    {
                        "cid": "37446",
                        "cname": "孩子用",
                        "id": "2084240603"
                    },
                    {
                        "cid": "37447",
                        "cname": "女性用",
                        "id": "2084240604"
                    },
                    {
                        "cid": "37448",
                        "cname": "男性用的",
                        "id": "2084240610"
                    },
                    {
                        "cid": "37449",
                        "cname": "服饰小东西",
                        "id": "2084240611"
                    },
                    {
                        "cid": "37450",
                        "cname": "包/包",
                        "id": "2084240598"
                    },
                    {
                        "cid": "37451",
                        "cname": "手工",
                        "id": "2084240616"
                    },
                    {
                        "cid": "37452",
                        "cname": "手工作品",
                        "id": "2084240626"
                    },
                    {
                        "cid": "37453",
                        "cname": "手工工艺/工艺",
                        "id": "20924"
                    }
                ]
            },
            {
                "cid": "20321",
                "cname": "首饰/手表",
                "id": "23140",
                "children": [
                    {
                        "cid": "37466",
                        "cname": "品牌首饰",
                        "id": "2084052553"
                    },
                    {
                        "cid": "37467",
                        "cname": "妇女装饰品",
                        "id": "2084005359"
                    },
                    {
                        "cid": "37468",
                        "cname": "男士饰品",
                        "id": "2084005358"
                    },
                    {
                        "cid": "37469",
                        "cname": "孩子用饰品",
                        "id": "2084006476"
                    },
                    {
                        "cid": "37470",
                        "cname": "品牌手表",
                        "id": "23260"
                    },
                    {
                        "cid": "37471",
                        "cname": "精品男士手表",
                        "id": "23264"
                    },
                    {
                        "cid": "37472",
                        "cname": "女士手表",
                        "id": "23268"
                    },
                    {
                        "cid": "37473",
                        "cname": "中性手表",
                        "id": "23272"
                    },
                    {
                        "cid": "37474",
                        "cname": "角色手表",
                        "id": "2084024554"
                    },
                    {
                        "cid": "37475",
                        "cname": "怀表",
                        "id": "23276"
                    },
                    {
                        "cid": "37476",
                        "cname": "表用腰带/乐队",
                        "id": "2084024555"
                    },
                    {
                        "cid": "37477",
                        "cname": "附有卷发功能",
                        "id": "2084062498"
                    },
                    {
                        "cid": "37478",
                        "cname": "表用的盒子",
                        "id": "2084024557"
                    },
                    {
                        "cid": "37479",
                        "cname": "表用工具",
                        "id": "2084024556"
                    },
                    {
                        "cid": "37480",
                        "cname": "座钟/挂钟",
                        "id": "2084032117"
                    },
                    {
                        "cid": "37481",
                        "cname": "手工",
                        "id": "2084240616"
                    }
                ]
            },
            {
                "cid": "20322",
                "cname": "户外服装",
                "id": "24802",
                "children": [
                    {
                        "cid": "14125",
                        "cname": "品牌分类",
                        "id": "2084057251"
                    },
                    {
                        "cid": "14126",
                        "cname": "男性用的",
                        "id": "2084057221"
                    },
                    {
                        "cid": "14127",
                        "cname": "女性用",
                        "id": "2084057222"
                    },
                    {
                        "cid": "14128",
                        "cname": "孩子用",
                        "id": "2084057223"
                    },
                    {
                        "cid": "14129",
                        "cname": "体育太阳镜",
                        "id": "2084214045"
                    },
                    {
                        "cid": "14130",
                        "cname": "雨具/雨衣",
                        "id": "2084046735"
                    },
                    {
                        "cid": "14131",
                        "cname": "鞋",
                        "id": "2084048872"
                    },
                    {
                        "cid": "14132",
                        "cname": "服饰小东西",
                        "id": "2084057242"
                    }
                ]
            },
            {
                "cid": "20323",
                "cname": "运动服",
                "id": "23008",
                "children": [
                    {
                        "cid": "13864",
                        "cname": "男性用的",
                        "id": "2084005276"
                    },
                    {
                        "cid": "13865",
                        "cname": "女性用",
                        "id": "2084006829"
                    },
                    {
                        "cid": "13866",
                        "cname": "男女兼用",
                        "id": "2084024291"
                    },
                    {
                        "cid": "13867",
                        "cname": "孩子用",
                        "id": "2084024292"
                    },
                    {
                        "cid": "13868",
                        "cname": "体育不同",
                        "id": "25152"
                    },
                    {
                        "cid": "13869",
                        "cname": "体育太阳镜",
                        "id": "2084214045"
                    },
                    {
                        "cid": "13870",
                        "cname": "户外运动服装",
                        "id": "24802"
                    },
                    {
                        "cid": "13871",
                        "cname": "衫",
                        "id": "2084006766"
                    },
                    {
                        "cid": "13872",
                        "cname": "游泳衣",
                        "id": "2084051883"
                    }
                ]
            },
            {
                "cid": "20324",
                "cname": "香水",
                "id": "42179",
                "children": [
                    {
                        "cid": "40489",
                        "cname": "女性用",
                        "id": "2084005302"
                    },
                    {
                        "cid": "40490",
                        "cname": "男性用",
                        "id": "2084005301"
                    },
                    {
                        "cid": "40491",
                        "cname": "男女合用",
                        "id": "2084005303"
                    },
                    {
                        "cid": "40492",
                        "cname": "按品牌分类",
                        "id": "2084059595"
                    },
                    {
                        "cid": "40493",
                        "cname": "熏香,香炉",
                        "id": "2084024424"
                    },
                    {
                        "cid": "40494",
                        "cname": "香熏蜡烛",
                        "id": "2084024423"
                    },
                    {
                        "cid": "40495",
                        "cname": "香水喷壶/喷雾器",
                        "id": "2084061895"
                    },
                    {
                        "cid": "40496",
                        "cname": "其他",
                        "id": "2084005304"
                    }
                ]
            },
            {
                "cid": "20325",
                "cname": "时尚小物",
                "id": "21912",
                "children": [
                    {
                        "cid": "4995",
                        "cname": "事物趋势信息",
                        "id": "2084008142"
                    },
                    {
                        "cid": "4996",
                        "cname": "女性",
                        "id": "2084008050"
                    },
                    {
                        "cid": "4997",
                        "cname": "男性",
                        "id": "2084008049"
                    }
                ]
            },
            {
                "cid": "20326",
                "cname": "cosplay服装",
                "id": "2084062134",
                "children": [
                    {
                        "cid": "47125",
                        "cname": "漫画/动画/游戏角色",
                        "id": "2084208670"
                    },
                    {
                        "cid": "47126",
                        "cname": "女佣服",
                        "id": "2084208672"
                    },
                    {
                        "cid": "47127",
                        "cname": "Gothloli (Gothic Lolita)",
                        "id": "2084241336"
                    },
                    {
                        "cid": "47128",
                        "cname": "乘务员",
                        "id": "2084311910"
                    },
                    {
                        "cid": "47129",
                        "cname": "旗袍",
                        "id": "2084241337"
                    },
                    {
                        "cid": "47130",
                        "cname": "护士衣服",
                        "id": "2084241335"
                    },
                    {
                        "cid": "47131",
                        "cname": "兔女郎",
                        "id": "2084241339"
                    },
                    {
                        "cid": "47132",
                        "cname": "Baby doll",
                        "id": "2084311903"
                    },
                    {
                        "cid": "47133",
                        "cname": "赛车皇后模仿秀服装",
                        "id": "2084241338"
                    },
                    {
                        "cid": "47134",
                        "cname": "校服",
                        "id": "2084311904"
                    },
                    {
                        "cid": "47135",
                        "cname": "老师",
                        "id": "2084311905"
                    },
                    {
                        "cid": "47136",
                        "cname": "泳装",
                        "id": "2084311906"
                    },
                    {
                        "cid": "47137",
                        "cname": "体操服",
                        "id": "2084311907"
                    },
                    {
                        "cid": "47138",
                        "cname": "和服/和服",
                        "id": "2084311908"
                    },
                    {
                        "cid": "47139",
                        "cname": "警察",
                        "id": "2084311909"
                    },
                    {
                        "cid": "47140",
                        "cname": "男性用",
                        "id": "2084241340"
                    },
                    {
                        "cid": "47141",
                        "cname": "其他",
                        "id": "2084208673"
                    }
                ]
            },
            {
                "cid": "20327",
                "cname": "时尚搭配",
                "id": "2084307758",
                "children": []
            },
        ]
    },
    
	{
        "cid": "12",
        "cname": "首饰/手表",
        "id": "23140",
        "children": [
            {
                "cid": "37466",
                "cname": "品牌首饰",
                "id": "2084052553",
                "children": [
                    {
                        "cid": "37482",
                        "cname": "A & G",
                        "id": "2084061912"
                    },
                    {
                        "cid": "37483",
                        "cname": "AHKAH",
                        "id": "2084301266"
                    },
                    {
                        "cid": "37484",
                        "cname": "AGATHA",
                        "id": "2084057874"
                    },
                    {
                        "cid": "37485",
                        "cname": "agete",
                        "id": "2084061839"
                    },
                    {
                        "cid": "37486",
                        "cname": "Abercrombie＆Fitch",
                        "id": "2084061779"
                    },
                    {
                        "cid": "37487",
                        "cname": "HERMES（爱马仕）",
                        "id": "2084057765"
                    },
                    {
                        "cid": "37488",
                        "cname": "Q-pot",
                        "id": "2084245337"
                    },
                    {
                        "cid": "37489",
                        "cname": "Cartier",
                        "id": "2084052585"
                    },
                    {
                        "cid": "37490",
                        "cname": "Carrera y Carrera",
                        "id": "2084224327"
                    },
                    {
                        "cid": "37491",
                        "cname": "Gabor",
                        "id": "2084057913"
                    },
                    {
                        "cid": "37492",
                        "cname": "迪奥",
                        "id": "2084057781"
                    },
                    {
                        "cid": "37493",
                        "cname": "Courreges",
                        "id": "2084214586"
                    },
                    {
                        "cid": "37494",
                        "cname": "CRAZY PIG",
                        "id": "2084195400"
                    },
                    {
                        "cid": "37495",
                        "cname": "CHROME HEARTS",
                        "id": "2084052569"
                    },
                    {
                        "cid": "37496",
                        "cname": "GUCCI（古驰）",
                        "id": "2084057773"
                    },
                    {
                        "cid": "37497",
                        "cname": "COACH（蔻驰）",
                        "id": "2084285568"
                    },
                    {
                        "cid": "37498",
                        "cname": "COMME CA DU MODE",
                        "id": "2084057919"
                    },
                    {
                        "cid": "37499",
                        "cname": "goro’s",
                        "id": "2084292916"
                    },
                    {
                        "cid": "37500",
                        "cname": "CHANEL（香奈儿）",
                        "id": "2084057791"
                    },
                    {
                        "cid": "37501",
                        "cname": "chaumet",
                        "id": "2084057916"
                    },
                    {
                        "cid": "37502",
                        "cname": "Chopard",
                        "id": "2084057887"
                    },
                    {
                        "cid": "37503",
                        "cname": "GIVENCHY（纪梵希）",
                        "id": "2084062113"
                    },
                    {
                        "cid": "37504",
                        "cname": "贾斯汀戴维斯",
                        "id": "2084259184"
                    },
                    {
                        "cid": "37505",
                        "cname": "JAM HOME MADE",
                        "id": "2084211403"
                    },
                    {
                        "cid": "37506",
                        "cname": "乔治·ジェンセン",
                        "id": "2084195385"
                    },
                    {
                        "cid": "37507",
                        "cname": "STAR JEWELRY",
                        "id": "2084057892"
                    },
                    {
                        "cid": "37508",
                        "cname": "施华洛世奇",
                        "id": "2084212690"
                    },
                    {
                        "cid": "37509",
                        "cname": "Tateossian",
                        "id": "2084061872"
                    },
                    {
                        "cid": "37510",
                        "cname": "DAMIANI",
                        "id": "2084211290"
                    },
                    {
                        "cid": "37511",
                        "cname": "dunhill（登喜路）",
                        "id": "2084061866"
                    },
                    {
                        "cid": "37512",
                        "cname": "Tiffany（蒂芙尼）",
                        "id": "2084052592"
                    },
                    {
                        "cid": "37513",
                        "cname": "DE BEERS",
                        "id": "2084195391"
                    },
                    {
                        "cid": "37514",
                        "cname": "TRAVIS WALKER",
                        "id": "2084211400"
                    },
                    {
                        "cid": "37515",
                        "cname": "Dolce & Gabbana",
                        "id": "2084059826"
                    },
                    {
                        "cid": "37516",
                        "cname": "田崎珍珠",
                        "id": "2084061900"
                    },
                    {
                        "cid": "37517",
                        "cname": "NUMBER (N)INE",
                        "id": "2084061782"
                    },
                    {
                        "cid": "37518",
                        "cname": "NINA RICCI（莲娜丽姿）",
                        "id": "2084057897"
                    },
                    {
                        "cid": "37519",
                        "cname": "NOJESS",
                        "id": "2084242562"
                    },
                    {
                        "cid": "37520",
                        "cname": "哈利·温斯顿",
                        "id": "2084211287"
                    },
                    {
                        "cid": "37521",
                        "cname": "Baccarat",
                        "id": "2084057901"
                    },
                    {
                        "cid": "37522",
                        "cname": "BILL WALL LEATHER",
                        "id": "2084195403"
                    },
                    {
                        "cid": "37523",
                        "cname": "piaget",
                        "id": "2084211293"
                    },
                    {
                        "cid": "37524",
                        "cname": "Folli Follie",
                        "id": "2084057904"
                    },
                    {
                        "cid": "37525",
                        "cname": "FREESTYLE",
                        "id": "2084195409"
                    },
                    {
                        "cid": "37526",
                        "cname": "BOUCHERON",
                        "id": "2084211300"
                    },
                    {
                        "cid": "37527",
                        "cname": "Bloody Mary",
                        "id": "2084195393"
                    },
                    {
                        "cid": "37528",
                        "cname": "BLOOM",
                        "id": "2084195392"
                    },
                    {
                        "cid": "37529",
                        "cname": "bvlgari（宝格丽）",
                        "id": "2084052554"
                    },
                    {
                        "cid": "37530",
                        "cname": "保罗·史密斯",
                        "id": "2084061856"
                    },
                    {
                        "cid": "37531",
                        "cname": "Pomellato",
                        "id": "2084211297"
                    },
                    {
                        "cid": "37532",
                        "cname": "Ponte Vecchio",
                        "id": "2084301273"
                    },
                    {
                        "cid": "37533",
                        "cname": "Van Cleef & Arpels",
                        "id": "2084057880"
                    },
                    {
                        "cid": "37534",
                        "cname": "VENDOME AOYAMA",
                        "id": "2084057883"
                    },
                    {
                        "cid": "37535",
                        "cname": "Vivienne Westwood（维维安·韦斯特伍德）",
                        "id": "2084061789"
                    },
                    {
                        "cid": "37536",
                        "cname": "MIKIMOTO",
                        "id": "2084061906"
                    },
                    {
                        "cid": "37537",
                        "cname": "迈克尔・ネグリン",
                        "id": "2084224324"
                    },
                    {
                        "cid": "37538",
                        "cname": "毫安·ハスケル",
                        "id": "2084224321"
                    },
                    {
                        "cid": "37539",
                        "cname": "4℃",
                        "id": "2084057866"
                    },
                    {
                        "cid": "37540",
                        "cname": "路易·威登",
                        "id": "2084061772"
                    },
                    {
                        "cid": "37541",
                        "cname": "LONE ONES/LEONARD KAMHOUT",
                        "id": "2084057910"
                    },
                    {
                        "cid": "37542",
                        "cname": "Lord Camelot",
                        "id": "2084214030"
                    },
                    {
                        "cid": "37543",
                        "cname": "Loree Rodkin",
                        "id": "2084210883"
                    },
                    {
                        "cid": "37544",
                        "cname": "ROYAL ORDER",
                        "id": "2084195394"
                    },
                    {
                        "cid": "37545",
                        "cname": "其他",
                        "id": "2084284916"
                    }
                ]
            },
            {
                "cid": "37467",
                "cname": "女士饰品",
                "id": "2084005359",
                "children": [
                    {
                        "cid": "37844",
                        "cname": "项链、吊坠",
                        "id": "2084005389"
                    },
                    {
                        "cid": "37845",
                        "cname": "吊坠",
                        "id": "2084060087"
                    },
                    {
                        "cid": "37846",
                        "cname": "项链（链子）",
                        "id": "2084060086"
                    },
                    {
                        "cid": "37847",
                        "cname": "项链",
                        "id": "2084005391"
                    },
                    {
                        "cid": "37848",
                        "cname": "戒指",
                        "id": "2084005425"
                    },
                    {
                        "cid": "37849",
                        "cname": "耳环",
                        "id": "2084005417"
                    },
                    {
                        "cid": "37850",
                        "cname": "耳坠",
                        "id": "2084005410"
                    },
                    {
                        "cid": "37851",
                        "cname": "手链、手镯",
                        "id": "2084005365"
                    },
                    {
                        "cid": "37852",
                        "cname": "脚镯",
                        "id": "2084005436"
                    },
                    {
                        "cid": "37853",
                        "cname": "裸石/金刚石",
                        "id": "2084019048"
                    },
                    {
                        "cid": "37854",
                        "cname": "胸针",
                        "id": "2084005369"
                    },
                    {
                        "cid": "37855",
                        "cname": "头饰",
                        "id": "2084005370"
                    },
                    {
                        "cid": "37856",
                        "cname": "头花",
                        "id": "2084012460"
                    },
                    {
                        "cid": "37857",
                        "cname": "身体用耳环耳钉",
                        "id": "2084023700"
                    },
                    {
                        "cid": "37858",
                        "cname": "吊坠",
                        "id": "2084060087"
                    },
                    {
                        "cid": "37859",
                        "cname": "手机挂件",
                        "id": "2084005064"
                    },
                    {
                        "cid": "37860",
                        "cname": "首饰盒",
                        "id": "2084005437"
                    }
                ]
            },
            {
                "cid": "37468",
                "cname": "男士饰品",
                "id": "2084005358",
                "children": [
                    {
                        "cid": "38472",
                        "cname": "项链",
                        "id": "2084006909"
                    },
                    {
                        "cid": "38473",
                        "cname": "吊坠",
                        "id": "2084006910"
                    },
                    {
                        "cid": "38474",
                        "cname": "吊坠",
                        "id": "2084292881"
                    },
                    {
                        "cid": "38475",
                        "cname": "手链、手镯",
                        "id": "2084005360"
                    },
                    {
                        "cid": "38476",
                        "cname": "戒指",
                        "id": "2084007896"
                    },
                    {
                        "cid": "38477",
                        "cname": "钥匙链/钱包链子",
                        "id": "2084023760"
                    },
                    {
                        "cid": "38478",
                        "cname": "领带夹",
                        "id": "2084005363"
                    },
                    {
                        "cid": "38479",
                        "cname": "袖扣",
                        "id": "2084005362"
                    },
                    {
                        "cid": "38480",
                        "cname": "耳环",
                        "id": "2084007897"
                    },
                    {
                        "cid": "38481",
                        "cname": "身体用耳环耳钉",
                        "id": "2084023699"
                    },
                    {
                        "cid": "38482",
                        "cname": "带扣",
                        "id": "2084023706"
                    },
                    {
                        "cid": "38483",
                        "cname": "钱夹",
                        "id": "2084023711"
                    },
                    {
                        "cid": "38484",
                        "cname": "ウイッグ",
                        "id": "2084062533"
                    },
                    {
                        "cid": "38485",
                        "cname": "钥匙扣",
                        "id": "40427"
                    },
                    {
                        "cid": "38486",
                        "cname": "项链",
                        "id": "2084006911"
                    },
                    {
                        "cid": "38487",
                        "cname": "打火机",
                        "id": "26138"
                    },
                    {
                        "cid": "38488",
                        "cname": "手机挂件",
                        "id": "2084005064"
                    },
                    {
                        "cid": "38489",
                        "cname": "情况",
                        "id": "2084008418"
                    },
                    {
                        "cid": "38490",
                        "cname": "裸石/金刚石",
                        "id": "2084019048"
                    },
                    {
                        "cid": "38491",
                        "cname": "其他",
                        "id": "2084062070"
                    }
                ]
            },
            {
                "cid": "37469",
                "cname": "儿童饰品",
                "id": "2084006476",
                "children": [
                    {
                        "cid": "38604",
                        "cname": "镇流器",
                        "id": "2084006501"
                    },
                    {
                        "cid": "38605",
                        "cname": "橡胶发圈/发圈",
                        "id": "2084006665"
                    },
                    {
                        "cid": "38606",
                        "cname": "发带/发箍",
                        "id": "2084006500"
                    },
                    {
                        "cid": "38607",
                        "cname": "发夹",
                        "id": "2084006502"
                    },
                    {
                        "cid": "38608",
                        "cname": "蝴蝶结",
                        "id": "2084006477"
                    },
                    {
                        "cid": "38609",
                        "cname": "其他",
                        "id": "2084006478"
                    }
                ]
            },
            {
                "cid": "37470",
                "cname": "日本手表",
                "id": "23260",
                "children": [
                    {
                        "cid": "38616",
                        "cname": "あ行",
                        "id": "2084059709"
                    },
                    {
                        "cid": "38617",
                        "cname": "か行",
                        "id": "2084059710"
                    },
                    {
                        "cid": "38618",
                        "cname": "さ行",
                        "id": "2084059711"
                    },
                    {
                        "cid": "38619",
                        "cname": "た行",
                        "id": "2084059712"
                    },
                    {
                        "cid": "38620",
                        "cname": "な行",
                        "id": "2084212694"
                    },
                    {
                        "cid": "38621",
                        "cname": "は行",
                        "id": "2084059714"
                    },
                    {
                        "cid": "38622",
                        "cname": "ま行、や行",
                        "id": "2084229196"
                    },
                    {
                        "cid": "38623",
                        "cname": "ら行",
                        "id": "2084059713"
                    }
                ]
            },
            {
                "cid": "37471",
                "cname": "男士手表",
                "id": "23264",
                "children": [
                    {
                        "cid": "39131",
                        "cname": "指针式表（石英式）",
                        "id": "2084050111"
                    },
                    {
                        "cid": "39132",
                        "cname": "指针式表（自动）",
                        "id": "2084050114"
                    },
                    {
                        "cid": "39133",
                        "cname": "指针式表（手卷）",
                        "id": "2084050113"
                    },
                    {
                        "cid": "39134",
                        "cname": "数码",
                        "id": "2084032153"
                    },
                    {
                        "cid": "39135",
                        "cname": "SWATCH",
                        "id": "2084005347"
                    },
                    {
                        "cid": "39136",
                        "cname": "CASIO（卡西欧）",
                        "id": "2084032114"
                    },
                    {
                        "cid": "39137",
                        "cname": "CITIZEN（西铁城）",
                        "id": "2084024505"
                    },
                    {
                        "cid": "39138",
                        "cname": "Seiko（精工）",
                        "id": "2084024503"
                    },
                    {
                        "cid": "39139",
                        "cname": "LUMINOX",
                        "id": "2084051029"
                    }
                ]
            },
            {
                "cid": "37472",
                "cname": "女士手表",
                "id": "23268",
                "children": [
                    {
                        "cid": "39170",
                        "cname": "指针式表（石英式）",
                        "id": "2084050117"
                    },
                    {
                        "cid": "39171",
                        "cname": "指针式表（自动）",
                        "id": "2084050120"
                    },
                    {
                        "cid": "39172",
                        "cname": "指针式表（手卷）",
                        "id": "2084050119"
                    },
                    {
                        "cid": "39173",
                        "cname": "数码",
                        "id": "2084032150"
                    },
                    {
                        "cid": "39174",
                        "cname": "SWATCH",
                        "id": "2084005347"
                    },
                    {
                        "cid": "39175",
                        "cname": "CASIO（卡西欧）",
                        "id": "2084032114"
                    },
                    {
                        "cid": "39176",
                        "cname": "CITIZEN（西铁城）",
                        "id": "2084024505"
                    },
                    {
                        "cid": "39177",
                        "cname": "Seiko（精工）",
                        "id": "2084024503"
                    }
                ]
            },
            {
                "cid": "37473",
                "cname": "中性手表",
                "id": "23272",
                "children": [
                    {
                        "cid": "39199",
                        "cname": "指针式表（石英式）",
                        "id": "2084053708"
                    },
                    {
                        "cid": "39200",
                        "cname": "指针式表（自动）",
                        "id": "2084053710"
                    },
                    {
                        "cid": "39201",
                        "cname": "指针式表（手卷）",
                        "id": "2084053711"
                    },
                    {
                        "cid": "39202",
                        "cname": "数码",
                        "id": "2084032152"
                    },
                    {
                        "cid": "39203",
                        "cname": "CASIO（卡西欧）",
                        "id": "2084032114"
                    },
                    {
                        "cid": "39204",
                        "cname": "CITIZEN（西铁城）",
                        "id": "2084024505"
                    },
                    {
                        "cid": "39205",
                        "cname": "Seiko（精工）",
                        "id": "2084024503"
                    }
                ]
            },
            {
                "cid": "37474",
                "cname": "卡通手表",
                "id": "2084024554",
                "children": [
                    {
                        "cid": "39227",
                        "cname": "史努比",
                        "id": "2084045713"
                    },
                    {
                        "cid": "39228",
                        "cname": "迪斯尼",
                        "id": "2084045712"
                    },
                    {
                        "cid": "39229",
                        "cname": "哆啦A梦",
                        "id": "2084045715"
                    },
                    {
                        "cid": "39230",
                        "cname": "Hello Kitty（凯蒂猫）",
                        "id": "2084045714"
                    },
                    {
                        "cid": "39231",
                        "cname": "其他",
                        "id": "2084045716"
                    }
                ]
            },
            {
                "cid": "37475",
                "cname": "怀表",
                "id": "23276",
                "children": [
                    {
                        "cid": "39237",
                        "cname": "石英式",
                        "id": "2084062953"
                    },
                    {
                        "cid": "39238",
                        "cname": "机械式",
                        "id": "2084062954"
                    }
                ]
            },
            {
                "cid": "37476",
                "cname": "表带/配件",
                "id": "2084024555",
                "children": [
                    {
                        "cid": "39241",
                        "cname": "橡胶皮带",
                        "id": "2084062472"
                    },
                    {
                        "cid": "39242",
                        "cname": "真皮皮带",
                        "id": "2084062470"
                    },
                    {
                        "cid": "39243",
                        "cname": "金属皮带",
                        "id": "2084062471"
                    },
                    {
                        "cid": "39244",
                        "cname": "织布腰带",
                        "id": "2084062473"
                    },
                    {
                        "cid": "39245",
                        "cname": "手表起针器",
                        "id": "2084062481"
                    },
                    {
                        "cid": "39246",
                        "cname": "精密起子",
                        "id": "2084062482"
                    },
                    {
                        "cid": "39247",
                        "cname": "皮带配件",
                        "id": "2084062474"
                    },
                    {
                        "cid": "39248",
                        "cname": "其他",
                        "id": "2084062478"
                    }
                ]
            },
            {
                "cid": "37477",
                "cname": "摇表器",
                "id": "2084062498",
                "children": []
            },
            {
                "cid": "37478",
                "cname": "表盒",
                "id": "2084024557",
                "children": [
                    {
                        "cid": "39256",
                        "cname": "普通收纳箱",
                        "id": "2084062493"
                    },
                    {
                        "cid": "39257",
                        "cname": "台座型",
                        "id": "2084062496"
                    },
                    {
                        "cid": "39258",
                        "cname": "附有卷发功能",
                        "id": "2084062498"
                    },
                    {
                        "cid": "39259",
                        "cname": "携带用",
                        "id": "2084062497"
                    }
                ]
            },
            {
                "cid": "37479",
                "cname": "手表工具/电池",
                "id": "2084024556",
                "children": [
                    {
                        "cid": "39262",
                        "cname": "套装",
                        "id": "2084062479"
                    },
                    {
                        "cid": "39263",
                        "cname": "开瓶器",
                        "id": "2084062480"
                    },
                    {
                        "cid": "39264",
                        "cname": "手表起针器",
                        "id": "2084062481"
                    },
                    {
                        "cid": "39265",
                        "cname": "钳子",
                        "id": "2084062483"
                    },
                    {
                        "cid": "39266",
                        "cname": "钳子",
                        "id": "2084042044"
                    },
                    {
                        "cid": "39267",
                        "cname": "放大镜",
                        "id": "2084062484"
                    },
                    {
                        "cid": "39268",
                        "cname": "精密起子",
                        "id": "2084062482"
                    },
                    {
                        "cid": "39269",
                        "cname": "手表的电池",
                        "id": "2084062491"
                    },
                    {
                        "cid": "39270",
                        "cname": "其他",
                        "id": "2084062485"
                    }
                ]
            },
            {
                "cid": "37480",
                "cname": "座钟/挂钟",
                "id": "2084032117",
                "children": [
                    {
                        "cid": "42615",
                        "cname": "挂钟、柱钟",
                        "id": "2084032127"
                    },
                    {
                        "cid": "42616",
                        "cname": "表用工具",
                        "id": "2084024556"
                    },
                    {
                        "cid": "42617",
                        "cname": "时钟",
                        "id": "2084032118"
                    }
                ]
            },
            {
                "cid": "37481",
                "cname": "手工",
                "id": "2084240616",
                "children": [
                    {
                        "cid": "39271",
                        "cname": "首饰（女性用）",
                        "id": "2084240617"
                    },
                    {
                        "cid": "39272",
                        "cname": "手工",
                        "id": "2084236962"
                    },
                    {
                        "cid": "39273",
                        "cname": "手工",
                        "id": "2084236963"
                    },
                    {
                        "cid": "39274",
                        "cname": "手工工艺/工艺",
                        "id": "20924"
                    },
                    {
                        "cid": "39275",
                        "cname": "其他",
                        "id": "2084240623"
                    }
                ]
            }
        ]
    },
	{
	    "cid": "jiu",
	    "cname": "厨刀",
	    "id": "jiu",
		"children": [
			// {
			//     "cname": "酒类",
			//     "id": "2084006720",
			// },
			{
				"cname": "厨刀",
				"id": "2084005972",
			}
		]
	}
	
]

export default clasMenu